RT-Thread/rt-thread/bsp/mb9bf568r/CMSIS/DeviceSupport/mb9b560r.h
typedef struct stc_intreq_irq097mon_field
{
  __IO uint32_t QUDINT0    : 1;
  __IO uint32_t QUDINT1    : 1;
  __IO uint32_t QUDINT2    : 1;
  __IO uint32_t QUDINT3    : 1;
  __IO uint32_t QUDINT4    : 1;
  __IO uint32_t QUDINT5    : 1;
} stc_intreq_irq097mon_field_t;

typedef struct stc_intreq_irq098mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq098mon_field_t;

typedef struct stc_intreq_irq099mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq099mon_field_t;

typedef struct stc_intreq_irq100mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq100mon_field_t;

typedef struct stc_intreq_irq101mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
} stc_intreq_irq101mon_field_t;

typedef struct stc_intreq_irq102mon_field
{
  __IO uint32_t BTINT0     : 1;
  __IO uint32_t BTINT1     : 1;
  __IO uint32_t BTINT2     : 1;
  __IO uint32_t BTINT3     : 1;
  __IO uint32_t BTINT4     : 1;
  __IO uint32_t BTINT5     : 1;
  __IO uint32_t BTINT6     : 1;
  __IO uint32_t BTINT7     : 1;
} stc_intreq_irq102mon_field_t;

typedef struct stc_intreq_irq103mon_field
{
  __IO uint32_t MFSRINT    : 1;
} stc_intreq_irq103mon_field_t;

typedef struct stc_intreq_irq104mon_field
{
  __IO uint32_t MFSINT0    : 1;
  __IO uint32_t MFSINT1    : 1;
} stc_intreq_irq104mon_field_t;

typedef struct stc_intreq_irq105mon_field
{
  __IO uint32_t MFSRINT    : 1;
} stc_intreq_irq105mon_field_t;

typedef struct stc_intreq_irq106mon_field
{
  __IO uint32_t MFSINT0    : 1;
  __IO uint32_t MFSINT1    : 1;
} stc_intreq_irq106mon_field_t;

typedef struct stc_intreq_irq107mon_field
{
  __IO uint32_t MFSRINT    : 1;
} stc_intreq_irq107mon_field_t;

typedef struct stc_intreq_irq108mon_field
{
  __IO uint32_t MFSINT0    : 1;
  __IO uint32_t MFSINT1    : 1;
} stc_intreq_irq108mon_field_t;

typedef struct stc_intreq_irq109mon_field
{
  __IO uint32_t MFSRINT    : 1;
} stc_intreq_irq109mon_field_t;

typedef struct stc_intreq_irq110mon_field
{
  __IO uint32_t MFSINT0    : 1;
  __IO uint32_t MFSINT1    : 1;
} stc_intreq_irq110mon_field_t;

typedef struct stc_intreq_irq111mon_field
{
  __IO uint32_t ADCINT0    : 1;
  __IO uint32_t ADCINT1    : 1;
  __IO uint32_t ADCINT2    : 1;
  __IO uint32_t ADCINT3    : 1;
  __IO uint32_t ADCINT4    : 1;
} stc_intreq_irq111mon_field_t;

typedef struct stc_intreq_irq113mon_field
{
  __IO uint32_t USB_DRQ_INT0: 1;
  __IO uint32_t USB_DRQ_INT1: 1;
  __IO uint32_t USB_DRQ_INT2: 1;
  __IO uint32_t USB_DRQ_INT3: 1;
  __IO uint32_t USB_DRQ_INT4: 1;
} stc_intreq_irq113mon_field_t;

typedef struct stc_intreq_irq114mon_field
{
  __IO uint32_t USB_INT0   : 1;
  __IO uint32_t USB_INT1   : 1;
  __IO uint32_t USB_INT2   : 1;
  __IO uint32_t USB_INT3   : 1;
  __IO uint32_t USB_INT4   : 1;
  __IO uint32_t USB_INT5   : 1;
} stc_intreq_irq114mon_field_t;

typedef struct stc_intreq_irq118mon_field
{
  __IO uint32_t SDINT0     : 1;
  __IO uint32_t SDINT1     : 1;
} stc_intreq_irq118mon_field_t;

typedef struct stc_intreq_irq119mon_field
{
  __IO uint32_t FLINT      : 1;
} stc_intreq_irq119mon_field_t;

typedef struct stc_intreq_irq120mon_field
{
  __IO uint32_t MFSRINT    : 1;
} stc_intreq_irq120mon_field_t;

typedef struct stc_intreq_irq121mon_field
{
  __IO uint32_t MFSINT0    : 1;
  __IO uint32_t MFSINT1    : 1;
} stc_intreq_irq121mon_field_t;

typedef struct stc_intreq_irq122mon_field
{
  __IO uint32_t MFSRINT    : 1;
} stc_intreq_irq122mon_field_t;

typedef struct stc_intreq_irq123mon_field
{
  __IO uint32_t MFSINT0    : 1;
  __IO uint32_t MFSINT1    : 1;
} stc_intreq_irq123mon_field_t;

typedef struct stc_intreq_irq124mon_field
{
  __IO uint32_t MFSRINT    : 1;
} stc_intreq_irq124mon_field_t;

typedef struct stc_intreq_irq125mon_field
{
  __IO uint32_t MFSINT0    : 1;
  __IO uint32_t MFSINT1    : 1;
} stc_intreq_irq125mon_field_t;

typedef struct stc_intreq_irq126mon_field
{
  __IO uint32_t MFSRINT    : 1;
} stc_intreq_irq126mon_field_t;

typedef struct stc_intreq_irq127mon_field
{
  __IO uint32_t MFSINT0    : 1;
  __IO uint32_t MFSINT1    : 1;
} stc_intreq_irq127mon_field_t;

/******************************************************************************
 * IRQSEL_MODULE
******************************************************************************/
typedef struct stc_irqsel_field
{
  __IO uint32_t SELIRQ    : 8;
       uint32_t RESERVED0 : 8;
  __IO uint32_t SELBIT    : 8;
       uint32_t RESERVED1 : 8;
} stc_irqsel_field_t;

/******************************************************************************
 * DSTC_MODULE
 ******************************************************************************/
/* DSTC_MODULE register bit fields */
typedef struct stc_dstc_hwdesp_field
{
  __IO uint32_t CHANNEL    : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t HWDESP     : 14;
       uint32_t RESERVED2  : 2;
} stc_dstc_hwdesp_field_t;

typedef struct stc_dstc_cfg_field
{
  __IO uint8_t  SWINTE     : 1;
  __IO uint8_t  ERINTE     : 1;
  __IO uint8_t  RBDIS      : 1;
  __IO uint8_t  ESTE       : 1;
  __IO uint8_t  SWPR       : 3;
       uint8_t  RESERVED   : 1;
} stc_dstc_cfg_field_t;

typedef struct stc_dstc_swtr_field
{
  __IO uint16_t SWDESP     : 14;
  __IO uint16_t SWREQ      : 1;
  __IO uint16_t SWST       : 1;
} stc_dstc_swtr_field_t;

typedef struct stc_dstc_moners_field
{
  __IO uint32_t EST        : 3;
  __IO uint32_t DER        : 1;
  __IO uint32_t ESTOP      : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t EHS        : 1;
  __IO uint32_t RESERVED2  : 1;
  __IO uint32_t ECH        : 8;
  __IO uint32_t EDESP      : 14;
       uint32_t RESERVED3  : 2;
} stc_dstc_moners_field_t;

/******************************************************************************
 * GPIO_MODULE
 ******************************************************************************/
/* GPIO_MODULE register bit fields */
typedef struct stc_gpio_pfr0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
  __IO uint32_t P05        : 1;
  __IO uint32_t P06        : 1;
  __IO uint32_t P07        : 1;
  __IO uint32_t P08        : 1;
  __IO uint32_t P09        : 1;
  __IO uint32_t P0A        : 1;
  __IO uint32_t P0B        : 1;
  __IO uint32_t P0C        : 1;
  __IO uint32_t P0D        : 1;
  __IO uint32_t P0E        : 1;
} stc_gpio_pfr0_field_t;

typedef struct stc_gpio_pfr1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
  __IO uint32_t P16        : 1;
  __IO uint32_t P17        : 1;
  __IO uint32_t P18        : 1;
  __IO uint32_t P19        : 1;
  __IO uint32_t P1A        : 1;
  __IO uint32_t P1B        : 1;
  __IO uint32_t P1C        : 1;
  __IO uint32_t P1D        : 1;
  __IO uint32_t P1E        : 1;
  __IO uint32_t P1F        : 1;
} stc_gpio_pfr1_field_t;

typedef struct stc_gpio_pfr2_field
{
  __IO uint32_t P20        : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
  __IO uint32_t P24        : 1;
  __IO uint32_t P25        : 1;
  __IO uint32_t P26        : 1;
  __IO uint32_t P27        : 1;
} stc_gpio_pfr2_field_t;

typedef struct stc_gpio_pfr3_field
{
  __IO uint32_t P30        : 1;
  __IO uint32_t P31        : 1;
  __IO uint32_t P32        : 1;
  __IO uint32_t P33        : 1;
  __IO uint32_t P34        : 1;
  __IO uint32_t P35        : 1;
  __IO uint32_t P36        : 1;
  __IO uint32_t P37        : 1;
  __IO uint32_t P38        : 1;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_gpio_pfr3_field_t;

typedef struct stc_gpio_pfr4_field
{
  __IO uint32_t P40        : 1;
  __IO uint32_t P41        : 1;
  __IO uint32_t P42        : 1;
  __IO uint32_t P43        : 1;
  __IO uint32_t P44        : 1;
  __IO uint32_t P45        : 1;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
  __IO uint32_t P48        : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
  __IO uint32_t P4B        : 1;
  __IO uint32_t P4C        : 1;
  __IO uint32_t P4D        : 1;
  __IO uint32_t P4E        : 1;
} stc_gpio_pfr4_field_t;

typedef struct stc_gpio_pfr5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
  __IO uint32_t P53        : 1;
  __IO uint32_t P54        : 1;
  __IO uint32_t P55        : 1;
  __IO uint32_t P56        : 1;
  __IO uint32_t P57        : 1;
  __IO uint32_t P58        : 1;
  __IO uint32_t P59        : 1;
  __IO uint32_t P5A        : 1;
  __IO uint32_t P5B        : 1;
} stc_gpio_pfr5_field_t;

