RT-Thread/rt-thread/bsp/mb9bf568r/CMSIS/DeviceSupport/mb9b560r.h
typedef struct stc_gpio_pfr6_field
{
  __IO uint32_t P60        : 1;
  __IO uint32_t P61        : 1;
  __IO uint32_t P62        : 1;
  __IO uint32_t P63        : 1;
  __IO uint32_t P64        : 1;
  __IO uint32_t P65        : 1;
  __IO uint32_t P66        : 1;
  __IO uint32_t P67        : 1;
  __IO uint32_t P68        : 1;
} stc_gpio_pfr6_field_t;

typedef struct stc_gpio_pfr7_field
{
  __IO uint32_t P70        : 1;
  __IO uint32_t P71        : 1;
  __IO uint32_t P72        : 1;
  __IO uint32_t P73        : 1;
  __IO uint32_t P74        : 1;
} stc_gpio_pfr7_field_t;

typedef struct stc_gpio_pfr8_field
{
  __IO uint32_t P80        : 1;
  __IO uint32_t P81        : 1;
} stc_gpio_pfr8_field_t;

typedef struct stc_gpio_pfre_field
{
  __IO uint32_t PE0        : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PE2        : 1;
  __IO uint32_t PE3        : 1;
} stc_gpio_pfre_field_t;

typedef struct stc_gpio_pcr0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
  __IO uint32_t P05        : 1;
  __IO uint32_t P06        : 1;
  __IO uint32_t P07        : 1;
  __IO uint32_t P08        : 1;
  __IO uint32_t P09        : 1;
  __IO uint32_t P0A        : 1;
  __IO uint32_t P0B        : 1;
  __IO uint32_t P0C        : 1;
  __IO uint32_t P0D        : 1;
  __IO uint32_t P0E        : 1;
} stc_gpio_pcr0_field_t;

typedef struct stc_gpio_pcr1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
  __IO uint32_t P16        : 1;
  __IO uint32_t P17        : 1;
  __IO uint32_t P18        : 1;
  __IO uint32_t P19        : 1;
  __IO uint32_t P1A        : 1;
  __IO uint32_t P1B        : 1;
  __IO uint32_t P1C        : 1;
  __IO uint32_t P1D        : 1;
  __IO uint32_t P1E        : 1;
  __IO uint32_t P1F        : 1;
} stc_gpio_pcr1_field_t;

typedef struct stc_gpio_pcr2_field
{
  __IO uint32_t P20        : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
  __IO uint32_t P24        : 1;
  __IO uint32_t P25        : 1;
  __IO uint32_t P26        : 1;
  __IO uint32_t P27        : 1;
} stc_gpio_pcr2_field_t;

typedef struct stc_gpio_pcr3_field
{
  __IO uint32_t P30        : 1;
  __IO uint32_t P31        : 1;
  __IO uint32_t P32        : 1;
  __IO uint32_t P33        : 1;
  __IO uint32_t P34        : 1;
  __IO uint32_t P35        : 1;
  __IO uint32_t P36        : 1;
  __IO uint32_t P37        : 1;
  __IO uint32_t P38        : 1;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_gpio_pcr3_field_t;

typedef struct stc_gpio_pcr4_field
{
  __IO uint32_t P40        : 1;
  __IO uint32_t P41        : 1;
  __IO uint32_t P42        : 1;
  __IO uint32_t P43        : 1;
  __IO uint32_t P44        : 1;
  __IO uint32_t P45        : 1;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
  __IO uint32_t P48        : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
  __IO uint32_t P4B        : 1;
  __IO uint32_t P4C        : 1;
  __IO uint32_t P4D        : 1;
  __IO uint32_t P4E        : 1;
} stc_gpio_pcr4_field_t;

typedef struct stc_gpio_pcr5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
  __IO uint32_t P53        : 1;
  __IO uint32_t P54        : 1;
  __IO uint32_t P55        : 1;
  __IO uint32_t P56        : 1;
  __IO uint32_t P57        : 1;
  __IO uint32_t P58        : 1;
  __IO uint32_t P59        : 1;
  __IO uint32_t P5A        : 1;
  __IO uint32_t P5B        : 1;
} stc_gpio_pcr5_field_t;

typedef struct stc_gpio_pcr6_field
{
  __IO uint32_t P60        : 1;
  __IO uint32_t P61        : 1;
  __IO uint32_t P62        : 1;
  __IO uint32_t P63        : 1;
  __IO uint32_t P64        : 1;
  __IO uint32_t P65        : 1;
  __IO uint32_t P66        : 1;
  __IO uint32_t P67        : 1;
  __IO uint32_t P68        : 1;
} stc_gpio_pcr6_field_t;

typedef struct stc_gpio_pcr7_field
{
  __IO uint32_t P70        : 1;
  __IO uint32_t P71        : 1;
  __IO uint32_t P72        : 1;
  __IO uint32_t P73        : 1;
  __IO uint32_t P74        : 1;
} stc_gpio_pcr7_field_t;

typedef struct stc_gpio_pcr8_field
{
  __IO uint32_t P80        : 1;
  __IO uint32_t P81        : 1;
} stc_gpio_pcr8_field_t;

typedef struct stc_gpio_pcre_field
{
  __IO uint32_t PE0        : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t PE2        : 1;
  __IO uint32_t PE3        : 1;
} stc_gpio_pcre_field_t;

typedef struct stc_gpio_ddr0_field
{
  __IO uint32_t P00        : 1;
  __IO uint32_t P01        : 1;
  __IO uint32_t P02        : 1;
  __IO uint32_t P03        : 1;
  __IO uint32_t P04        : 1;
  __IO uint32_t P05        : 1;
  __IO uint32_t P06        : 1;
  __IO uint32_t P07        : 1;
  __IO uint32_t P08        : 1;
  __IO uint32_t P09        : 1;
  __IO uint32_t P0A        : 1;
  __IO uint32_t P0B        : 1;
  __IO uint32_t P0C        : 1;
  __IO uint32_t P0D        : 1;
  __IO uint32_t P0E        : 1;
  __IO uint32_t P0F        : 1;
} stc_gpio_ddr0_field_t;

typedef struct stc_gpio_ddr1_field
{
  __IO uint32_t P10        : 1;
  __IO uint32_t P11        : 1;
  __IO uint32_t P12        : 1;
  __IO uint32_t P13        : 1;
  __IO uint32_t P14        : 1;
  __IO uint32_t P15        : 1;
  __IO uint32_t P16        : 1;
  __IO uint32_t P17        : 1;
  __IO uint32_t P18        : 1;
  __IO uint32_t P19        : 1;
  __IO uint32_t P1A        : 1;
  __IO uint32_t P1B        : 1;
  __IO uint32_t P1C        : 1;
  __IO uint32_t P1D        : 1;
  __IO uint32_t P1E        : 1;
  __IO uint32_t P1F        : 1;
} stc_gpio_ddr1_field_t;

typedef struct stc_gpio_ddr2_field
{
  __IO uint32_t P20        : 1;
  __IO uint32_t P21        : 1;
  __IO uint32_t P22        : 1;
  __IO uint32_t P23        : 1;
  __IO uint32_t P24        : 1;
  __IO uint32_t P25        : 1;
  __IO uint32_t P26        : 1;
  __IO uint32_t P27        : 1;
} stc_gpio_ddr2_field_t;

typedef struct stc_gpio_ddr3_field
{
  __IO uint32_t P30        : 1;
  __IO uint32_t P31        : 1;
  __IO uint32_t P32        : 1;
  __IO uint32_t P33        : 1;
  __IO uint32_t P34        : 1;
  __IO uint32_t P35        : 1;
  __IO uint32_t P36        : 1;
  __IO uint32_t P37        : 1;
  __IO uint32_t P38        : 1;
  __IO uint32_t P39        : 1;
  __IO uint32_t P3A        : 1;
  __IO uint32_t P3B        : 1;
  __IO uint32_t P3C        : 1;
  __IO uint32_t P3D        : 1;
  __IO uint32_t P3E        : 1;
  __IO uint32_t P3F        : 1;
} stc_gpio_ddr3_field_t;

typedef struct stc_gpio_ddr4_field
{
  __IO uint32_t P40        : 1;
  __IO uint32_t P41        : 1;
  __IO uint32_t P42        : 1;
  __IO uint32_t P43        : 1;
  __IO uint32_t P44        : 1;
  __IO uint32_t P45        : 1;
  __IO uint32_t P46        : 1;
  __IO uint32_t P47        : 1;
  __IO uint32_t P48        : 1;
  __IO uint32_t P49        : 1;
  __IO uint32_t P4A        : 1;
  __IO uint32_t P4B        : 1;
  __IO uint32_t P4C        : 1;
  __IO uint32_t P4D        : 1;
  __IO uint32_t P4E        : 1;
} stc_gpio_ddr4_field_t;

typedef struct stc_gpio_ddr5_field
{
  __IO uint32_t P50        : 1;
  __IO uint32_t P51        : 1;
  __IO uint32_t P52        : 1;
  __IO uint32_t P53        : 1;
  __IO uint32_t P54        : 1;
  __IO uint32_t P55        : 1;
  __IO uint32_t P56        : 1;
  __IO uint32_t P57        : 1;
  __IO uint32_t P58        : 1;
  __IO uint32_t P59        : 1;
  __IO uint32_t P5A        : 1;
  __IO uint32_t P5B        : 1;
} stc_gpio_ddr5_field_t;

