RT-Thread/rt-thread/bsp/mb9bf568r/CMSIS/DeviceSupport/mb9b560r.h
/******************************************************************************
 * LCR_MODULE
 ******************************************************************************/
/* Low-speed CR prescaler registers */
typedef struct
{
  union {
    __IO  uint8_t LCR_PRSLD;
    stc_lcr_lcr_prsld_field_t LCR_PRSLD_f;
  };
}FM4_LCR_TypeDef;

/******************************************************************************
 * CLK_GATING_MODULE
 ******************************************************************************/
/* CLK_GATING registers */
typedef struct
{
  union {
    __IO uint32_t CKEN0;
    stc_clk_gating_cken0_field_t CKEN0_f;
  };
  union {
    __IO uint32_t MRST0;
    stc_clk_gating_mrst0_field_t MRST0_f;
  };
       uint8_t RESERVED1[8];
  union {
    __IO uint32_t CKEN1;
    stc_clk_gating_cken1_field_t CKEN1_f;
  };
  union {
    __IO uint32_t MRST1;
    stc_clk_gating_mrst1_field_t MRST1_f;
  };
       uint8_t RESERVED3[8];
  union {
    __IO uint32_t CKEN2;
    stc_clk_gating_cken2_field_t CKEN2_f;
  };
  union {
    __IO uint32_t MRST2;
    stc_clk_gating_mrst2_field_t MRST2_f;
  };
}FM4_CLK_GATING_TypeDef;

/******************************************************************************
 * PLL_CONTROL_MODULE
 ******************************************************************************/
/* PLL_CONTROL registers */
typedef struct
{
  __IO uint32_t SSCTL1;
  __IO uint32_t SSCTL2;
}FM4_PLL_CONTROL_TypeDef;

/******************************************************************************
 * EXBUS_MODULE
 ******************************************************************************/
/* External bus interface registers */
typedef struct
{
  union {
    __IO uint32_t MODE0;
    stc_exbus_mode_field_t MODE0_f;
  };
  union {
    __IO uint32_t MODE1;
    stc_exbus_mode_field_t MODE1_f;
  };
  union {
    __IO uint32_t MODE2;
    stc_exbus_mode_field_t MODE2_f;
  };
  union {
    __IO uint32_t MODE3;
    stc_exbus_mode_field_t MODE3_f;
  };
  union {
    __IO uint32_t MODE4;
    stc_exbus_mode_field_t MODE4_f;
  };
  union {
    __IO uint32_t MODE5;
    stc_exbus_mode_field_t MODE5_f;
  };
  union {
    __IO uint32_t MODE6;
    stc_exbus_mode_field_t MODE6_f;
  };
  union {
    __IO uint32_t MODE7;
    stc_exbus_mode_field_t MODE7_f;
  };
  union {
    __IO uint32_t TIM0;
    stc_exbus_tim_field_t TIM0_f;
  };
  __IO uint32_t TIM1;
  union {
    __IO uint32_t TIM2;
    stc_exbus_tim_field_t TIM2_f;
  };
  union {
    __IO uint32_t TIM3;
    stc_exbus_tim_field_t TIM3_f;
  };
  union {
    __IO uint32_t TIM4;
    stc_exbus_tim_field_t TIM4_f;
  };
  union {
    __IO uint32_t TIM5;
    stc_exbus_tim_field_t TIM5_f;
  };
  union {
    __IO uint32_t TIM6;
    stc_exbus_tim_field_t TIM6_f;
  };
  union {
    __IO uint32_t TIM7;
    stc_exbus_tim_field_t TIM7_f;
  };
  union {
    __IO uint32_t AREA0;
    stc_exbus_area_field_t AREA0_f;
  };
  union {
    __IO uint32_t AREA1;
    stc_exbus_area_field_t AREA1_f;
  };
  union {
    __IO uint32_t AREA2;
    stc_exbus_area_field_t AREA2_f;
  };
  union {
    __IO uint32_t AREA3;
    stc_exbus_area_field_t AREA3_f;
  };
  union {
    __IO uint32_t AREA4;
    stc_exbus_area_field_t AREA4_f;
  };
  union {
    __IO uint32_t AREA5;
    stc_exbus_area_field_t AREA5_f;
  };
  union {
    __IO uint32_t AREA6;
    stc_exbus_area_field_t AREA6_f;
  };
  union {
    __IO uint32_t AREA7;
    stc_exbus_area_field_t AREA7_f;
  };
  union {
    __IO uint32_t ATIM0;
    stc_exbus_atim_field_t ATIM0_f;
  };
  union {
    __IO uint32_t ATIM1;
    stc_exbus_atim_field_t ATIM1_f;
  };
  union {
    __IO uint32_t ATIM2;
    stc_exbus_atim_field_t ATIM2_f;
  };
  union {
    __IO uint32_t ATIM3;
    stc_exbus_atim_field_t ATIM3_f;
  };
  union {
    __IO uint32_t ATIM4;
    stc_exbus_atim_field_t ATIM4_f;
  };
  union {
    __IO uint32_t ATIM5;
    stc_exbus_atim_field_t ATIM5_f;
  };
  union {
    __IO uint32_t ATIM6;
    stc_exbus_atim_field_t ATIM6_f;
  };
  union {
    __IO uint32_t ATIM7;
    stc_exbus_atim_field_t ATIM7_f;
  };
    uint8_t RESERVED1[128];
  union {
    __IO uint32_t SDMODE;
    stc_exbus_sdmode_field_t SDMODE_f;
  };
  union {
    __IO uint32_t REFTIM;
    stc_exbus_reftim_field_t REFTIM_f;
  };
  union {
    __IO uint32_t PWRDWN;
    stc_exbus_pwrdwn_field_t PWRDWN_f;
  };
  union {
    __IO uint32_t SDTIM;
    stc_exbus_sdtim_field_t SDTIM_f;
  };
  union {
    __IO uint32_t SDCMD;
    stc_exbus_sdcmd_field_t SDCMD_f;
  };
    uint8_t RESERVED2[236];
  union {
    __IO uint32_t MEMCERR;
    stc_exbus_memcerr_field_t MEMCERR_f;
  };
    uint8_t RESERVED3[252];
  union {
    __IO uint32_t DCLKR;
    stc_exbus_dclkr_field_t DCLKR_f;
  };
  union {
    __IO uint32_t EST;
    stc_exbus_est_field_t EST_f;
  };
  union {
    __IO uint32_t WEAD;
    stc_exbus_wead_field_t WEAD_f;
  };
  union {
    __IO uint32_t ESCLR;
    stc_exbus_esclr_field_t ESCLR_f;
  };
  union {
    __IO uint32_t AMODE;
    stc_exbus_amode_field_t AMODE_f;
  };
}FM4_EXBUS_TypeDef;

/******************************************************************************
 * USB_MODULE
 ******************************************************************************/
/* USB channel 0 registers */
typedef struct
{
  union {
    union {
      __IO uint16_t HCNT;
      stc_usb_hcnt_field_t HCNT_f;
    };
    struct {
      union {
        __IO  uint8_t HCNT0;
        stc_usb_hcnt0_field_t HCNT0_f;
      };
      union {
        __IO  uint8_t HCNT1;
        stc_usb_hcnt1_field_t HCNT1_f;
      };
    };
  };
        uint8_t RESERVED0[2];
  union {
    __IO  uint8_t HIRQ;
    stc_usb_hirq_field_t HIRQ_f;
  };
  union {
    __IO  uint8_t HERR;
    stc_usb_herr_field_t HERR_f;
  };
        uint8_t RESERVED1[2];
  union {
    __IO  uint8_t HSTATE;
    stc_usb_hstate_field_t HSTATE_f;
  };
  union {
    __IO  uint8_t HFCOMP;
    stc_usb_hfcomp_field_t HFCOMP_f;
  };
        uint8_t RESERVED2[2];
  union {
    union {
      __IO uint16_t HRTIMER;
      stc_usb_hrtimer_field_t HRTIMER_f;
    };
    struct {
      union {
        __IO  uint8_t HRTIMER0;
        stc_usb_hrtimer0_field_t HRTIMER0_f;
      };
      union {
        __IO  uint8_t HRTIMER1;
        stc_usb_hrtimer1_field_t HRTIMER1_f;
      };
    };
  };
        uint8_t RESERVED3[2];
  union {
    __IO  uint8_t HRTIMER2;
    stc_usb_hrtimer2_field_t HRTIMER2_f;
  };
  union {
    __IO  uint8_t HADR;
    stc_usb_hadr_field_t HADR_f;
  };
        uint8_t RESERVED4[2];
  union {
    union {
      __IO uint16_t HEOF;
      stc_usb_heof_field_t HEOF_f;
    };
    struct {
      union {
        __IO  uint8_t HEOF0;
        stc_usb_heof0_field_t HEOF0_f;
      };
      union {
        __IO  uint8_t HEOF1;
        stc_usb_heof1_field_t HEOF1_f;
      };
    };
  };
        uint8_t RESERVED5[2];
  union {
    union {
      __IO uint16_t HFRAME;
      stc_usb_hframe_field_t HFRAME_f;
    };
    struct {
      union {
        __IO  uint8_t HFRAME0;
        stc_usb_hframe0_field_t HFRAME0_f;
      };
      union {
        __IO  uint8_t HFRAME1;
        stc_usb_hframe1_field_t HFRAME1_f;
      };
    };
  };
        uint8_t RESERVED6[2];
  union {
    __IO  uint8_t HTOKEN;
    stc_usb_htoken_field_t HTOKEN_f;
  };
        uint8_t RESERVED7[3];
  union {
    __IO uint16_t UDCC;
    stc_usb_udcc_field_t UDCC_f;
  };
        uint8_t RESERVED8[2];
  union {
    __IO uint16_t EP0C;
    stc_usb_ep0c_field_t EP0C_f;
  };
        uint8_t RESERVED9[2];
  union {
    __IO uint16_t EP1C;
    stc_usb_ep1c_field_t EP1C_f;
  };
        uint8_t RESERVED10[2];
  union {
    __IO uint16_t EP2C;
    stc_usb_ep2c_field_t EP2C_f;
  };
        uint8_t RESERVED11[2];
  union {
    __IO uint16_t EP3C;
    stc_usb_ep3c_field_t EP3C_f;
  };
        uint8_t RESERVED12[2];
  union {
    __IO uint16_t EP4C;
    stc_usb_ep4c_field_t EP4C_f;
  };
        uint8_t RESERVED13[2];
  union {
    __IO uint16_t EP5C;
    stc_usb_ep5c_field_t EP5C_f;
  };
        uint8_t RESERVED14[2];
  union {
    __IO uint16_t TMSP;
    stc_usb_tmsp_field_t TMSP_f;
  };
        uint8_t RESERVED15[2];
  union {
    __IO  uint8_t UDCS;
    stc_usb_udcs_field_t UDCS_f;
  };
  union {
    __IO  uint8_t UDCIE;
    stc_usb_udcie_field_t UDCIE_f;
  };
        uint8_t RESERVED16[2];
  union {
    __IO uint16_t EP0IS;
    stc_usb_ep0is_field_t EP0IS_f;
  };
        uint8_t RESERVED17[2];
  union {
    __IO uint16_t EP0OS;
    stc_usb_ep0os_field_t EP0OS_f;
  };
        uint8_t RESERVED18[2];
  union {
    __IO uint16_t EP1S;
    stc_usb_ep1s_field_t EP1S_f;
  };
        uint8_t RESERVED19[2];
  union {
    __IO uint16_t EP2S;
    stc_usb_ep2s_field_t EP2S_f;
  };
        uint8_t RESERVED20[2];
  __IO uint16_t EP3S;
        uint8_t RESERVED21[2];
  union {
    __IO uint16_t EP4S;
    stc_usb_ep4s_field_t EP4S_f;
  };
        uint8_t RESERVED22[2];
  union {
    __IO uint16_t EP5S;
    stc_usb_ep5s_field_t EP5S_f;
  };
        uint8_t RESERVED23[2];
  union {
    __IO uint16_t EP0DT;
    struct {
      __IO  uint8_t EP0DTL;
      __IO  uint8_t EP0DTH;
    };
  };
        uint8_t RESERVED24[2];
  union {
    __IO uint16_t EP1DT;
    struct {
      __IO  uint8_t EP1DTL;
      __IO  uint8_t EP1DTH;
    };
  };
        uint8_t RESERVED25[2];
  union {
    __IO uint16_t EP2DT;
    struct {
      __IO  uint8_t EP2DTL;
      __IO  uint8_t EP2DTH;
    };
  };
        uint8_t RESERVED26[2];
  union {
    __IO uint16_t EP3DT;
    struct {
      __IO  uint8_t EP3DTL;
      __IO  uint8_t EP3DTH;
    };
  };
        uint8_t RESERVED27[2];
  union {
    __IO uint16_t EP4DT;
    struct {
      __IO  uint8_t EP4DTL;
      __IO  uint8_t EP4DTH;
    };
  };
        uint8_t RESERVED28[2];
  union {
    __IO uint16_t EP5DT;
    struct {
      __IO  uint8_t EP5DTL;
      __IO  uint8_t EP5DTH;
    };
  };
}FM4_USB_TypeDef;

