RT-Thread/rt-thread/bsp/mb9bf568r/CMSIS/DeviceSupport/mb9b560r.h
/******************************************************************************
 * Peripheral Bit Band Alias declaration
 ******************************************************************************/

/* Work Flash interface registers */
#define bFM4_WORKFLASH_IF_WFASZR_ASZ           *((volatile unsigned int*)(0x23C00000UL))
#define bFM4_WORKFLASH_IF_WFRWTR_RWT0          *((volatile unsigned int*)(0x23C00080UL))
#define bFM4_WORKFLASH_IF_WFRWTR_RWT1          *((volatile unsigned int*)(0x23C00084UL))
#define bFM4_WORKFLASH_IF_WFRWTR_RWT2          *((volatile unsigned int*)(0x23C00088UL))
#define bFM4_WORKFLASH_IF_WFSTR_RDY            *((volatile unsigned int*)(0x23C00100UL))
#define bFM4_WORKFLASH_IF_WFSTR_HNG            *((volatile unsigned int*)(0x23C00104UL))

/* Flash interface registers */
#define bFM4_FLASH_IF_FASZR_ASZ0               *((volatile unsigned int*)(0x42000000UL))
#define bFM4_FLASH_IF_FASZR_ASZ1               *((volatile unsigned int*)(0x42000004UL))
#define bFM4_FLASH_IF_FRWTR_RWT0               *((volatile unsigned int*)(0x42000080UL))
#define bFM4_FLASH_IF_FRWTR_RWT1               *((volatile unsigned int*)(0x42000084UL))
#define bFM4_FLASH_IF_FSTR_RDY                 *((volatile unsigned int*)(0x42000100UL))
#define bFM4_FLASH_IF_FSTR_HNG                 *((volatile unsigned int*)(0x42000104UL))
#define bFM4_FLASH_IF_FSTR_ERR                 *((volatile unsigned int*)(0x42000108UL))
#define bFM4_FLASH_IF_FSYNDN_SD0               *((volatile unsigned int*)(0x42000200UL))
#define bFM4_FLASH_IF_FSYNDN_SD1               *((volatile unsigned int*)(0x42000204UL))
#define bFM4_FLASH_IF_FSYNDN_SD2               *((volatile unsigned int*)(0x42000208UL))
#define bFM4_FLASH_IF_FBFCR_BE                 *((volatile unsigned int*)(0x42000280UL))
#define bFM4_FLASH_IF_FBFCR_BS                 *((volatile unsigned int*)(0x42000284UL))
#define bFM4_FLASH_IF_FICR_RDYIE               *((volatile unsigned int*)(0x42000400UL))
#define bFM4_FLASH_IF_FICR_HANGIE              *((volatile unsigned int*)(0x42000404UL))
#define bFM4_FLASH_IF_FICR_ERRIE               *((volatile unsigned int*)(0x42000408UL))
#define bFM4_FLASH_IF_FISR_RDYIF               *((volatile unsigned int*)(0x42000480UL))
#define bFM4_FLASH_IF_FISR_HANGIF              *((volatile unsigned int*)(0x42000484UL))
#define bFM4_FLASH_IF_FISR_ERRIF               *((volatile unsigned int*)(0x42000488UL))
#define bFM4_FLASH_IF_FICLR_RDYIC              *((volatile unsigned int*)(0x42000500UL))
#define bFM4_FLASH_IF_FICLR_HANGIC             *((volatile unsigned int*)(0x42000504UL))
#define bFM4_FLASH_IF_FICLR_ERRIC              *((volatile unsigned int*)(0x42000508UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM0             *((volatile unsigned int*)(0x42002000UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM1             *((volatile unsigned int*)(0x42002004UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM2             *((volatile unsigned int*)(0x42002008UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM3             *((volatile unsigned int*)(0x4200200CUL))
#define bFM4_FLASH_IF_CRTRMM_TRMM4             *((volatile unsigned int*)(0x42002010UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM5             *((volatile unsigned int*)(0x42002014UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM6             *((volatile unsigned int*)(0x42002018UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM7             *((volatile unsigned int*)(0x4200201CUL))
#define bFM4_FLASH_IF_CRTRMM_TRMM8             *((volatile unsigned int*)(0x42002020UL))
#define bFM4_FLASH_IF_CRTRMM_TRMM9             *((volatile unsigned int*)(0x42002024UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM0            *((volatile unsigned int*)(0x42002040UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM1            *((volatile unsigned int*)(0x42002044UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM2            *((volatile unsigned int*)(0x42002048UL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM3            *((volatile unsigned int*)(0x4200204CUL))
#define bFM4_FLASH_IF_CRTRMM_TTRMM4            *((volatile unsigned int*)(0x42002050UL))

/* Unique ID registers */
#define bFM4_UNIQUE_ID_UIDR0_UID0              *((volatile unsigned int*)(0x42004010UL))
#define bFM4_UNIQUE_ID_UIDR0_UID1              *((volatile unsigned int*)(0x42004014UL))
#define bFM4_UNIQUE_ID_UIDR0_UID2              *((volatile unsigned int*)(0x42004018UL))
#define bFM4_UNIQUE_ID_UIDR0_UID3              *((volatile unsigned int*)(0x4200401CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID4              *((volatile unsigned int*)(0x42004020UL))
#define bFM4_UNIQUE_ID_UIDR0_UID5              *((volatile unsigned int*)(0x42004024UL))
#define bFM4_UNIQUE_ID_UIDR0_UID6              *((volatile unsigned int*)(0x42004028UL))
#define bFM4_UNIQUE_ID_UIDR0_UID7              *((volatile unsigned int*)(0x4200402CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID8              *((volatile unsigned int*)(0x42004030UL))
#define bFM4_UNIQUE_ID_UIDR0_UID9              *((volatile unsigned int*)(0x42004034UL))
#define bFM4_UNIQUE_ID_UIDR0_UID10             *((volatile unsigned int*)(0x42004038UL))
#define bFM4_UNIQUE_ID_UIDR0_UID11             *((volatile unsigned int*)(0x4200403CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID12             *((volatile unsigned int*)(0x42004040UL))
#define bFM4_UNIQUE_ID_UIDR0_UID13             *((volatile unsigned int*)(0x42004044UL))
#define bFM4_UNIQUE_ID_UIDR0_UID14             *((volatile unsigned int*)(0x42004048UL))
#define bFM4_UNIQUE_ID_UIDR0_UID15             *((volatile unsigned int*)(0x4200404CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID16             *((volatile unsigned int*)(0x42004050UL))
#define bFM4_UNIQUE_ID_UIDR0_UID17             *((volatile unsigned int*)(0x42004054UL))
#define bFM4_UNIQUE_ID_UIDR0_UID18             *((volatile unsigned int*)(0x42004058UL))
#define bFM4_UNIQUE_ID_UIDR0_UID19             *((volatile unsigned int*)(0x4200405CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID20             *((volatile unsigned int*)(0x42004060UL))
#define bFM4_UNIQUE_ID_UIDR0_UID21             *((volatile unsigned int*)(0x42004064UL))
#define bFM4_UNIQUE_ID_UIDR0_UID22             *((volatile unsigned int*)(0x42004068UL))
#define bFM4_UNIQUE_ID_UIDR0_UID23             *((volatile unsigned int*)(0x4200406CUL))
#define bFM4_UNIQUE_ID_UIDR0_UID24             *((volatile unsigned int*)(0x42004070UL))
#define bFM4_UNIQUE_ID_UIDR0_UID25             *((volatile unsigned int*)(0x42004074UL))
#define bFM4_UNIQUE_ID_UIDR0_UID26             *((volatile unsigned int*)(0x42004078UL))
#define bFM4_UNIQUE_ID_UIDR0_UID27             *((volatile unsigned int*)(0x4200407CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID28             *((volatile unsigned int*)(0x42004080UL))
#define bFM4_UNIQUE_ID_UIDR1_UID29             *((volatile unsigned int*)(0x42004084UL))
#define bFM4_UNIQUE_ID_UIDR1_UID30             *((volatile unsigned int*)(0x42004088UL))
#define bFM4_UNIQUE_ID_UIDR1_UID31             *((volatile unsigned int*)(0x4200408CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID32             *((volatile unsigned int*)(0x42004090UL))
#define bFM4_UNIQUE_ID_UIDR1_UID33             *((volatile unsigned int*)(0x42004094UL))
#define bFM4_UNIQUE_ID_UIDR1_UID34             *((volatile unsigned int*)(0x42004098UL))
#define bFM4_UNIQUE_ID_UIDR1_UID35             *((volatile unsigned int*)(0x4200409CUL))
#define bFM4_UNIQUE_ID_UIDR1_UID36             *((volatile unsigned int*)(0x420040A0UL))
#define bFM4_UNIQUE_ID_UIDR1_UID37             *((volatile unsigned int*)(0x420040A4UL))
#define bFM4_UNIQUE_ID_UIDR1_UID38             *((volatile unsigned int*)(0x420040A8UL))
#define bFM4_UNIQUE_ID_UIDR1_UID39             *((volatile unsigned int*)(0x420040ACUL))
#define bFM4_UNIQUE_ID_UIDR1_UID40             *((volatile unsigned int*)(0x420040B0UL))

