RT-Thread/rt-thread/bsp/mb9bf568r/CMSIS/DeviceSupport/mb9b560r.h
#define bFM4_ADC1_ADSS23_TS24                  *((volatile unsigned int*)(0x424E2520UL))
#define bFM4_ADC1_ADSS23_TS25                  *((volatile unsigned int*)(0x424E2524UL))
#define bFM4_ADC1_ADSS23_TS26                  *((volatile unsigned int*)(0x424E2528UL))
#define bFM4_ADC1_ADSS23_TS27                  *((volatile unsigned int*)(0x424E252CUL))
#define bFM4_ADC1_ADSS23_TS28                  *((volatile unsigned int*)(0x424E2530UL))
#define bFM4_ADC1_ADSS23_TS29                  *((volatile unsigned int*)(0x424E2534UL))
#define bFM4_ADC1_ADSS23_TS30                  *((volatile unsigned int*)(0x424E2538UL))
#define bFM4_ADC1_ADSS23_TS31                  *((volatile unsigned int*)(0x424E253CUL))
#define bFM4_ADC1_ADSS2_TS16                   *((volatile unsigned int*)(0x424E2500UL))
#define bFM4_ADC1_ADSS2_TS17                   *((volatile unsigned int*)(0x424E2504UL))
#define bFM4_ADC1_ADSS2_TS18                   *((volatile unsigned int*)(0x424E2508UL))
#define bFM4_ADC1_ADSS2_TS19                   *((volatile unsigned int*)(0x424E250CUL))
#define bFM4_ADC1_ADSS2_TS20                   *((volatile unsigned int*)(0x424E2510UL))
#define bFM4_ADC1_ADSS2_TS21                   *((volatile unsigned int*)(0x424E2514UL))
#define bFM4_ADC1_ADSS2_TS22                   *((volatile unsigned int*)(0x424E2518UL))
#define bFM4_ADC1_ADSS2_TS23                   *((volatile unsigned int*)(0x424E251CUL))
#define bFM4_ADC1_ADSS3_TS24                   *((volatile unsigned int*)(0x424E2520UL))
#define bFM4_ADC1_ADSS3_TS25                   *((volatile unsigned int*)(0x424E2524UL))
#define bFM4_ADC1_ADSS3_TS26                   *((volatile unsigned int*)(0x424E2528UL))
#define bFM4_ADC1_ADSS3_TS27                   *((volatile unsigned int*)(0x424E252CUL))
#define bFM4_ADC1_ADSS3_TS28                   *((volatile unsigned int*)(0x424E2530UL))
#define bFM4_ADC1_ADSS3_TS29                   *((volatile unsigned int*)(0x424E2534UL))
#define bFM4_ADC1_ADSS3_TS30                   *((volatile unsigned int*)(0x424E2538UL))
#define bFM4_ADC1_ADSS3_TS31                   *((volatile unsigned int*)(0x424E253CUL))
#define bFM4_ADC1_ADSS01_TS0                   *((volatile unsigned int*)(0x424E2580UL))
#define bFM4_ADC1_ADSS01_TS1                   *((volatile unsigned int*)(0x424E2584UL))
#define bFM4_ADC1_ADSS01_TS2                   *((volatile unsigned int*)(0x424E2588UL))
#define bFM4_ADC1_ADSS01_TS3                   *((volatile unsigned int*)(0x424E258CUL))
#define bFM4_ADC1_ADSS01_TS4                   *((volatile unsigned int*)(0x424E2590UL))
#define bFM4_ADC1_ADSS01_TS5                   *((volatile unsigned int*)(0x424E2594UL))
#define bFM4_ADC1_ADSS01_TS6                   *((volatile unsigned int*)(0x424E2598UL))
#define bFM4_ADC1_ADSS01_TS7                   *((volatile unsigned int*)(0x424E259CUL))
#define bFM4_ADC1_ADSS01_TS8                   *((volatile unsigned int*)(0x424E25A0UL))
#define bFM4_ADC1_ADSS01_TS9                   *((volatile unsigned int*)(0x424E25A4UL))
#define bFM4_ADC1_ADSS01_TS10                  *((volatile unsigned int*)(0x424E25A8UL))
#define bFM4_ADC1_ADSS01_TS11                  *((volatile unsigned int*)(0x424E25ACUL))
#define bFM4_ADC1_ADSS01_TS12                  *((volatile unsigned int*)(0x424E25B0UL))
#define bFM4_ADC1_ADSS01_TS13                  *((volatile unsigned int*)(0x424E25B4UL))
#define bFM4_ADC1_ADSS01_TS14                  *((volatile unsigned int*)(0x424E25B8UL))
#define bFM4_ADC1_ADSS01_TS15                  *((volatile unsigned int*)(0x424E25BCUL))
#define bFM4_ADC1_ADSS0_TS0                    *((volatile unsigned int*)(0x424E2580UL))
#define bFM4_ADC1_ADSS0_TS1                    *((volatile unsigned int*)(0x424E2584UL))
#define bFM4_ADC1_ADSS0_TS2                    *((volatile unsigned int*)(0x424E2588UL))
#define bFM4_ADC1_ADSS0_TS3                    *((volatile unsigned int*)(0x424E258CUL))
#define bFM4_ADC1_ADSS0_TS4                    *((volatile unsigned int*)(0x424E2590UL))
#define bFM4_ADC1_ADSS0_TS5                    *((volatile unsigned int*)(0x424E2594UL))
#define bFM4_ADC1_ADSS0_TS6                    *((volatile unsigned int*)(0x424E2598UL))
#define bFM4_ADC1_ADSS0_TS7                    *((volatile unsigned int*)(0x424E259CUL))
#define bFM4_ADC1_ADSS1_TS8                    *((volatile unsigned int*)(0x424E25A0UL))
#define bFM4_ADC1_ADSS1_TS9                    *((volatile unsigned int*)(0x424E25A4UL))
#define bFM4_ADC1_ADSS1_TS10                   *((volatile unsigned int*)(0x424E25A8UL))
#define bFM4_ADC1_ADSS1_TS11                   *((volatile unsigned int*)(0x424E25ACUL))
#define bFM4_ADC1_ADSS1_TS12                   *((volatile unsigned int*)(0x424E25B0UL))
#define bFM4_ADC1_ADSS1_TS13                   *((volatile unsigned int*)(0x424E25B4UL))
#define bFM4_ADC1_ADSS1_TS14                   *((volatile unsigned int*)(0x424E25B8UL))
#define bFM4_ADC1_ADSS1_TS15                   *((volatile unsigned int*)(0x424E25BCUL))
#define bFM4_ADC1_ADST01_ST10                  *((volatile unsigned int*)(0x424E2600UL))
#define bFM4_ADC1_ADST01_ST11                  *((volatile unsigned int*)(0x424E2604UL))
#define bFM4_ADC1_ADST01_ST12                  *((volatile unsigned int*)(0x424E2608UL))
#define bFM4_ADC1_ADST01_ST13                  *((volatile unsigned int*)(0x424E260CUL))
#define bFM4_ADC1_ADST01_ST14                  *((volatile unsigned int*)(0x424E2610UL))
#define bFM4_ADC1_ADST01_STX10                 *((volatile unsigned int*)(0x424E2614UL))
#define bFM4_ADC1_ADST01_STX11                 *((volatile unsigned int*)(0x424E2618UL))
#define bFM4_ADC1_ADST01_STX12                 *((volatile unsigned int*)(0x424E261CUL))
#define bFM4_ADC1_ADST01_ST00                  *((volatile unsigned int*)(0x424E2620UL))
#define bFM4_ADC1_ADST01_ST01                  *((volatile unsigned int*)(0x424E2624UL))
#define bFM4_ADC1_ADST01_ST02                  *((volatile unsigned int*)(0x424E2628UL))
#define bFM4_ADC1_ADST01_ST03                  *((volatile unsigned int*)(0x424E262CUL))
#define bFM4_ADC1_ADST01_ST04                  *((volatile unsigned int*)(0x424E2630UL))
#define bFM4_ADC1_ADST01_STX00                 *((volatile unsigned int*)(0x424E2634UL))
#define bFM4_ADC1_ADST01_STX01                 *((volatile unsigned int*)(0x424E2638UL))
#define bFM4_ADC1_ADST01_STX02                 *((volatile unsigned int*)(0x424E263CUL))
#define bFM4_ADC1_ADST1_ST10                   *((volatile unsigned int*)(0x424E2600UL))
#define bFM4_ADC1_ADST1_ST11                   *((volatile unsigned int*)(0x424E2604UL))
#define bFM4_ADC1_ADST1_ST12                   *((volatile unsigned int*)(0x424E2608UL))
#define bFM4_ADC1_ADST1_ST13                   *((volatile unsigned int*)(0x424E260CUL))
#define bFM4_ADC1_ADST1_ST14                   *((volatile unsigned int*)(0x424E2610UL))
#define bFM4_ADC1_ADST1_STX10                  *((volatile unsigned int*)(0x424E2614UL))
#define bFM4_ADC1_ADST1_STX11                  *((volatile unsigned int*)(0x424E2618UL))
#define bFM4_ADC1_ADST1_STX12                  *((volatile unsigned int*)(0x424E261CUL))
#define bFM4_ADC1_ADST0_ST00                   *((volatile unsigned int*)(0x424E2620UL))
#define bFM4_ADC1_ADST0_ST01                   *((volatile unsigned int*)(0x424E2624UL))
#define bFM4_ADC1_ADST0_ST02                   *((volatile unsigned int*)(0x424E2628UL))
#define bFM4_ADC1_ADST0_ST03                   *((volatile unsigned int*)(0x424E262CUL))
#define bFM4_ADC1_ADST0_ST04                   *((volatile unsigned int*)(0x424E2630UL))
#define bFM4_ADC1_ADST0_STX00                  *((volatile unsigned int*)(0x424E2634UL))
#define bFM4_ADC1_ADST0_STX01                  *((volatile unsigned int*)(0x424E2638UL))
#define bFM4_ADC1_ADST0_STX02                  *((volatile unsigned int*)(0x424E263CUL))
#define bFM4_ADC1_ADCT_CT0                     *((volatile unsigned int*)(0x424E2680UL))
#define bFM4_ADC1_ADCT_CT1                     *((volatile unsigned int*)(0x424E2684UL))
#define bFM4_ADC1_ADCT_CT2                     *((volatile unsigned int*)(0x424E2688UL))
#define bFM4_ADC1_PRTSL_PRTSL0                 *((volatile unsigned int*)(0x424E2700UL))
#define bFM4_ADC1_PRTSL_PRTSL1                 *((volatile unsigned int*)(0x424E2704UL))
#define bFM4_ADC1_PRTSL_PRTSL2                 *((volatile unsigned int*)(0x424E2708UL))
#define bFM4_ADC1_PRTSL_PRTSL3                 *((volatile unsigned int*)(0x424E270CUL))
#define bFM4_ADC1_SCTSL_SCTSL0                 *((volatile unsigned int*)(0x424E2720UL))
#define bFM4_ADC1_SCTSL_SCTSL1                 *((volatile unsigned int*)(0x424E2724UL))
#define bFM4_ADC1_SCTSL_SCTSL2                 *((volatile unsigned int*)(0x424E2728UL))
#define bFM4_ADC1_SCTSL_SCTSL3                 *((volatile unsigned int*)(0x424E272CUL))
#define bFM4_ADC1_ADCEN_ENBL                   *((volatile unsigned int*)(0x424E2780UL))
#define bFM4_ADC1_ADCEN_READY                  *((volatile unsigned int*)(0x424E2784UL))

