RT-Thread/rt-thread/bsp/mb9bf568r/CMSIS/DeviceSupport/mb9b560r.h
/* MFS LIN channel 11 registers */
#define bFM4_MFS11_LIN_SMR_SOE                 *((volatile unsigned int*)(0x42716000UL))
#define bFM4_MFS11_LIN_SMR_SBL                 *((volatile unsigned int*)(0x4271600CUL))
#define bFM4_MFS11_LIN_SMR_WUCR                *((volatile unsigned int*)(0x42716010UL))
#define bFM4_MFS11_LIN_SMR_MD0                 *((volatile unsigned int*)(0x42716014UL))
#define bFM4_MFS11_LIN_SMR_MD1                 *((volatile unsigned int*)(0x42716018UL))
#define bFM4_MFS11_LIN_SMR_MD2                 *((volatile unsigned int*)(0x4271601CUL))
#define bFM4_MFS11_LIN_SCR_TXE                 *((volatile unsigned int*)(0x42716020UL))
#define bFM4_MFS11_LIN_SCR_RXE                 *((volatile unsigned int*)(0x42716024UL))
#define bFM4_MFS11_LIN_SCR_TBIE                *((volatile unsigned int*)(0x42716028UL))
#define bFM4_MFS11_LIN_SCR_TIE                 *((volatile unsigned int*)(0x4271602CUL))
#define bFM4_MFS11_LIN_SCR_RIE                 *((volatile unsigned int*)(0x42716030UL))
#define bFM4_MFS11_LIN_SCR_LBR                 *((volatile unsigned int*)(0x42716034UL))
#define bFM4_MFS11_LIN_SCR_MS                  *((volatile unsigned int*)(0x42716038UL))
#define bFM4_MFS11_LIN_SCR_UPCL                *((volatile unsigned int*)(0x4271603CUL))
#define bFM4_MFS11_LIN_ESCR_DEL0               *((volatile unsigned int*)(0x42716080UL))
#define bFM4_MFS11_LIN_ESCR_DEL1               *((volatile unsigned int*)(0x42716084UL))
#define bFM4_MFS11_LIN_ESCR_LBL0               *((volatile unsigned int*)(0x42716088UL))
#define bFM4_MFS11_LIN_ESCR_LBL1               *((volatile unsigned int*)(0x4271608CUL))
#define bFM4_MFS11_LIN_ESCR_LBIE               *((volatile unsigned int*)(0x42716090UL))
#define bFM4_MFS11_LIN_ESCR_ESBL               *((volatile unsigned int*)(0x42716098UL))
#define bFM4_MFS11_LIN_SSR_TBI                 *((volatile unsigned int*)(0x427160A0UL))
#define bFM4_MFS11_LIN_SSR_TDRE                *((volatile unsigned int*)(0x427160A4UL))
#define bFM4_MFS11_LIN_SSR_RDRF                *((volatile unsigned int*)(0x427160A8UL))
#define bFM4_MFS11_LIN_SSR_ORE                 *((volatile unsigned int*)(0x427160ACUL))
#define bFM4_MFS11_LIN_SSR_FRE                 *((volatile unsigned int*)(0x427160B0UL))
#define bFM4_MFS11_LIN_SSR_LBD                 *((volatile unsigned int*)(0x427160B4UL))
#define bFM4_MFS11_LIN_SSR_REC                 *((volatile unsigned int*)(0x427160BCUL))
#define bFM4_MFS11_LIN_BGR_EXT                 *((volatile unsigned int*)(0x427161BCUL))
#define bFM4_MFS11_LIN_BGR1_EXT                *((volatile unsigned int*)(0x427161BCUL))
#define bFM4_MFS11_LIN_FCR_FE1                 *((volatile unsigned int*)(0x42716280UL))
#define bFM4_MFS11_LIN_FCR_FE2                 *((volatile unsigned int*)(0x42716284UL))
#define bFM4_MFS11_LIN_FCR_FCL1                *((volatile unsigned int*)(0x42716288UL))
#define bFM4_MFS11_LIN_FCR_FCL2                *((volatile unsigned int*)(0x4271628CUL))
#define bFM4_MFS11_LIN_FCR_FSET                *((volatile unsigned int*)(0x42716290UL))
#define bFM4_MFS11_LIN_FCR_FLD                 *((volatile unsigned int*)(0x42716294UL))
#define bFM4_MFS11_LIN_FCR_FLST                *((volatile unsigned int*)(0x42716298UL))
#define bFM4_MFS11_LIN_FCR_FSEL                *((volatile unsigned int*)(0x427162A0UL))
#define bFM4_MFS11_LIN_FCR_FTIE                *((volatile unsigned int*)(0x427162A4UL))
#define bFM4_MFS11_LIN_FCR_FDRQ                *((volatile unsigned int*)(0x427162A8UL))
#define bFM4_MFS11_LIN_FCR_FRIIE               *((volatile unsigned int*)(0x427162ACUL))
#define bFM4_MFS11_LIN_FCR_FLSTE               *((volatile unsigned int*)(0x427162B0UL))
#define bFM4_MFS11_LIN_FCR0_FE1                *((volatile unsigned int*)(0x42716280UL))
#define bFM4_MFS11_LIN_FCR0_FE2                *((volatile unsigned int*)(0x42716284UL))
#define bFM4_MFS11_LIN_FCR0_FCL1               *((volatile unsigned int*)(0x42716288UL))
#define bFM4_MFS11_LIN_FCR0_FCL2               *((volatile unsigned int*)(0x4271628CUL))
#define bFM4_MFS11_LIN_FCR0_FSET               *((volatile unsigned int*)(0x42716290UL))
#define bFM4_MFS11_LIN_FCR0_FLD                *((volatile unsigned int*)(0x42716294UL))
#define bFM4_MFS11_LIN_FCR0_FLST               *((volatile unsigned int*)(0x42716298UL))
#define bFM4_MFS11_LIN_FCR1_FSEL               *((volatile unsigned int*)(0x427162A0UL))
#define bFM4_MFS11_LIN_FCR1_FTIE               *((volatile unsigned int*)(0x427162A4UL))
#define bFM4_MFS11_LIN_FCR1_FDRQ               *((volatile unsigned int*)(0x427162A8UL))
#define bFM4_MFS11_LIN_FCR1_FRIIE              *((volatile unsigned int*)(0x427162ACUL))
#define bFM4_MFS11_LIN_FCR1_FLSTE              *((volatile unsigned int*)(0x427162B0UL))
#define bFM4_MFS11_LIN_FBYTE_FD0               *((volatile unsigned int*)(0x42716300UL))
#define bFM4_MFS11_LIN_FBYTE_FD1               *((volatile unsigned int*)(0x42716304UL))
#define bFM4_MFS11_LIN_FBYTE_FD2               *((volatile unsigned int*)(0x42716308UL))
#define bFM4_MFS11_LIN_FBYTE_FD3               *((volatile unsigned int*)(0x4271630CUL))
#define bFM4_MFS11_LIN_FBYTE_FD4               *((volatile unsigned int*)(0x42716310UL))
#define bFM4_MFS11_LIN_FBYTE_FD5               *((volatile unsigned int*)(0x42716314UL))
#define bFM4_MFS11_LIN_FBYTE_FD6               *((volatile unsigned int*)(0x42716318UL))
#define bFM4_MFS11_LIN_FBYTE_FD7               *((volatile unsigned int*)(0x4271631CUL))
#define bFM4_MFS11_LIN_FBYTE_FD8               *((volatile unsigned int*)(0x42716320UL))
#define bFM4_MFS11_LIN_FBYTE_FD9               *((volatile unsigned int*)(0x42716324UL))
#define bFM4_MFS11_LIN_FBYTE_FD10              *((volatile unsigned int*)(0x42716328UL))
#define bFM4_MFS11_LIN_FBYTE_FD11              *((volatile unsigned int*)(0x4271632CUL))
#define bFM4_MFS11_LIN_FBYTE_FD12              *((volatile unsigned int*)(0x42716330UL))
#define bFM4_MFS11_LIN_FBYTE_FD13              *((volatile unsigned int*)(0x42716334UL))
#define bFM4_MFS11_LIN_FBYTE_FD14              *((volatile unsigned int*)(0x42716338UL))
#define bFM4_MFS11_LIN_FBYTE_FD15              *((volatile unsigned int*)(0x4271633CUL))
#define bFM4_MFS11_LIN_FBYTE1_FD0              *((volatile unsigned int*)(0x42716300UL))
#define bFM4_MFS11_LIN_FBYTE1_FD1              *((volatile unsigned int*)(0x42716304UL))
#define bFM4_MFS11_LIN_FBYTE1_FD2              *((volatile unsigned int*)(0x42716308UL))
#define bFM4_MFS11_LIN_FBYTE1_FD3              *((volatile unsigned int*)(0x4271630CUL))
#define bFM4_MFS11_LIN_FBYTE1_FD4              *((volatile unsigned int*)(0x42716310UL))
#define bFM4_MFS11_LIN_FBYTE1_FD5              *((volatile unsigned int*)(0x42716314UL))
#define bFM4_MFS11_LIN_FBYTE1_FD6              *((volatile unsigned int*)(0x42716318UL))
#define bFM4_MFS11_LIN_FBYTE1_FD7              *((volatile unsigned int*)(0x4271631CUL))
#define bFM4_MFS11_LIN_FBYTE2_FD8              *((volatile unsigned int*)(0x42716320UL))
#define bFM4_MFS11_LIN_FBYTE2_FD9              *((volatile unsigned int*)(0x42716324UL))
#define bFM4_MFS11_LIN_FBYTE2_FD10             *((volatile unsigned int*)(0x42716328UL))
#define bFM4_MFS11_LIN_FBYTE2_FD11             *((volatile unsigned int*)(0x4271632CUL))
#define bFM4_MFS11_LIN_FBYTE2_FD12             *((volatile unsigned int*)(0x42716330UL))
#define bFM4_MFS11_LIN_FBYTE2_FD13             *((volatile unsigned int*)(0x42716334UL))
#define bFM4_MFS11_LIN_FBYTE2_FD14             *((volatile unsigned int*)(0x42716338UL))
#define bFM4_MFS11_LIN_FBYTE2_FD15             *((volatile unsigned int*)(0x4271633CUL))

/* MFS I2C channel 11 registers */
#define bFM4_MFS11_I2C_SMR_TIE                 *((volatile unsigned int*)(0x42716008UL))
#define bFM4_MFS11_I2C_SMR_RIE                 *((volatile unsigned int*)(0x4271600CUL))
#define bFM4_MFS11_I2C_SMR_MD0                 *((volatile unsigned int*)(0x42716014UL))
#define bFM4_MFS11_I2C_SMR_MD1                 *((volatile unsigned int*)(0x42716018UL))
#define bFM4_MFS11_I2C_SMR_MD2                 *((volatile unsigned int*)(0x4271601CUL))
#define bFM4_MFS11_I2C_IBCR_INT                *((volatile unsigned int*)(0x42716020UL))
#define bFM4_MFS11_I2C_IBCR_BER                *((volatile unsigned int*)(0x42716024UL))
#define bFM4_MFS11_I2C_IBCR_INTE               *((volatile unsigned int*)(0x42716028UL))
#define bFM4_MFS11_I2C_IBCR_CNDE               *((volatile unsigned int*)(0x4271602CUL))
#define bFM4_MFS11_I2C_IBCR_WSEL               *((volatile unsigned int*)(0x42716030UL))
#define bFM4_MFS11_I2C_IBCR_ACKE               *((volatile unsigned int*)(0x42716034UL))
#define bFM4_MFS11_I2C_IBCR_ACT                *((volatile unsigned int*)(0x42716038UL))
#define bFM4_MFS11_I2C_IBCR_SCC                *((volatile unsigned int*)(0x42716038UL))
#define bFM4_MFS11_I2C_IBCR_MSS                *((volatile unsigned int*)(0x4271603CUL))
#define bFM4_MFS11_I2C_IBSR_BB                 *((volatile unsigned int*)(0x42716080UL))
#define bFM4_MFS11_I2C_IBSR_SPC                *((volatile unsigned int*)(0x42716084UL))
#define bFM4_MFS11_I2C_IBSR_RSC                *((volatile unsigned int*)(0x42716088UL))
#define bFM4_MFS11_I2C_IBSR_AL                 *((volatile unsigned int*)(0x4271608CUL))
#define bFM4_MFS11_I2C_IBSR_TRX                *((volatile unsigned int*)(0x42716090UL))
#define bFM4_MFS11_I2C_IBSR_RSA                *((volatile unsigned int*)(0x42716094UL))
#define bFM4_MFS11_I2C_IBSR_RACK               *((volatile unsigned int*)(0x42716098UL))
#define bFM4_MFS11_I2C_IBSR_FBT                *((volatile unsigned int*)(0x4271609CUL))
#define bFM4_MFS11_I2C_SSR_TBI                 *((volatile unsigned int*)(0x427160A0UL))
#define bFM4_MFS11_I2C_SSR_TDRE                *((volatile unsigned int*)(0x427160A4UL))
#define bFM4_MFS11_I2C_SSR_RDRF                *((volatile unsigned int*)(0x427160A8UL))
#define bFM4_MFS11_I2C_SSR_ORE                 *((volatile unsigned int*)(0x427160ACUL))
#define bFM4_MFS11_I2C_SSR_TBIE                *((volatile unsigned int*)(0x427160B0UL))
#define bFM4_MFS11_I2C_SSR_DMA                 *((volatile unsigned int*)(0x427160B4UL))
#define bFM4_MFS11_I2C_SSR_TSET                *((volatile unsigned int*)(0x427160B8UL))
#define bFM4_MFS11_I2C_SSR_REC                 *((volatile unsigned int*)(0x427160BCUL))
#define bFM4_MFS11_I2C_ISBA_SA0                *((volatile unsigned int*)(0x42716200UL))
#define bFM4_MFS11_I2C_ISBA_SA1                *((volatile unsigned int*)(0x42716204UL))
#define bFM4_MFS11_I2C_ISBA_SA2                *((volatile unsigned int*)(0x42716208UL))
#define bFM4_MFS11_I2C_ISBA_SA3                *((volatile unsigned int*)(0x4271620CUL))
#define bFM4_MFS11_I2C_ISBA_SA4                *((volatile unsigned int*)(0x42716210UL))
#define bFM4_MFS11_I2C_ISBA_SA5                *((volatile unsigned int*)(0x42716214UL))
#define bFM4_MFS11_I2C_ISBA_SA6                *((volatile unsigned int*)(0x42716218UL))
#define bFM4_MFS11_I2C_ISBA_SAEN               *((volatile unsigned int*)(0x4271621CUL))
#define bFM4_MFS11_I2C_ISMK_SM0                *((volatile unsigned int*)(0x42716220UL))
#define bFM4_MFS11_I2C_ISMK_SM1                *((volatile unsigned int*)(0x42716224UL))
#define bFM4_MFS11_I2C_ISMK_SM2                *((volatile unsigned int*)(0x42716228UL))
#define bFM4_MFS11_I2C_ISMK_SM3                *((volatile unsigned int*)(0x4271622CUL))
#define bFM4_MFS11_I2C_ISMK_SM4                *((volatile unsigned int*)(0x42716230UL))
#define bFM4_MFS11_I2C_ISMK_SM5                *((volatile unsigned int*)(0x42716234UL))
#define bFM4_MFS11_I2C_ISMK_SM6                *((volatile unsigned int*)(0x42716238UL))
#define bFM4_MFS11_I2C_ISMK_EN                 *((volatile unsigned int*)(0x4271623CUL))
#define bFM4_MFS11_I2C_FCR_FE1                 *((volatile unsigned int*)(0x42716280UL))
#define bFM4_MFS11_I2C_FCR_FE2                 *((volatile unsigned int*)(0x42716284UL))
#define bFM4_MFS11_I2C_FCR_FCL1                *((volatile unsigned int*)(0x42716288UL))
#define bFM4_MFS11_I2C_FCR_FCL2                *((volatile unsigned int*)(0x4271628CUL))
#define bFM4_MFS11_I2C_FCR_FSET                *((volatile unsigned int*)(0x42716290UL))
#define bFM4_MFS11_I2C_FCR_FLD                 *((volatile unsigned int*)(0x42716294UL))
#define bFM4_MFS11_I2C_FCR_FLST                *((volatile unsigned int*)(0x42716298UL))
#define bFM4_MFS11_I2C_FCR_FSEL                *((volatile unsigned int*)(0x427162A0UL))
#define bFM4_MFS11_I2C_FCR_FTIE                *((volatile unsigned int*)(0x427162A4UL))
#define bFM4_MFS11_I2C_FCR_FDRQ                *((volatile unsigned int*)(0x427162A8UL))
#define bFM4_MFS11_I2C_FCR_FRIIE               *((volatile unsigned int*)(0x427162ACUL))
#define bFM4_MFS11_I2C_FCR_FLSTE               *((volatile unsigned int*)(0x427162B0UL))
#define bFM4_MFS11_I2C_FCR0_FE1                *((volatile unsigned int*)(0x42716280UL))
#define bFM4_MFS11_I2C_FCR0_FE2                *((volatile unsigned int*)(0x42716284UL))
#define bFM4_MFS11_I2C_FCR0_FCL1               *((volatile unsigned int*)(0x42716288UL))
#define bFM4_MFS11_I2C_FCR0_FCL2               *((volatile unsigned int*)(0x4271628CUL))
#define bFM4_MFS11_I2C_FCR0_FSET               *((volatile unsigned int*)(0x42716290UL))
#define bFM4_MFS11_I2C_FCR0_FLD                *((volatile unsigned int*)(0x42716294UL))
#define bFM4_MFS11_I2C_FCR0_FLST               *((volatile unsigned int*)(0x42716298UL))
#define bFM4_MFS11_I2C_FCR1_FSEL               *((volatile unsigned int*)(0x427162A0UL))
#define bFM4_MFS11_I2C_FCR1_FTIE               *((volatile unsigned int*)(0x427162A4UL))
#define bFM4_MFS11_I2C_FCR1_FDRQ               *((volatile unsigned int*)(0x427162A8UL))
#define bFM4_MFS11_I2C_FCR1_FRIIE              *((volatile unsigned int*)(0x427162ACUL))
#define bFM4_MFS11_I2C_FCR1_FLSTE              *((volatile unsigned int*)(0x427162B0UL))
#define bFM4_MFS11_I2C_FBYTE_FD0               *((volatile unsigned int*)(0x42716300UL))
#define bFM4_MFS11_I2C_FBYTE_FD1               *((volatile unsigned int*)(0x42716304UL))
#define bFM4_MFS11_I2C_FBYTE_FD2               *((volatile unsigned int*)(0x42716308UL))
#define bFM4_MFS11_I2C_FBYTE_FD3               *((volatile unsigned int*)(0x4271630CUL))
#define bFM4_MFS11_I2C_FBYTE_FD4               *((volatile unsigned int*)(0x42716310UL))
#define bFM4_MFS11_I2C_FBYTE_FD5               *((volatile unsigned int*)(0x42716314UL))
#define bFM4_MFS11_I2C_FBYTE_FD6               *((volatile unsigned int*)(0x42716318UL))
#define bFM4_MFS11_I2C_FBYTE_FD7               *((volatile unsigned int*)(0x4271631CUL))
#define bFM4_MFS11_I2C_FBYTE_FD8               *((volatile unsigned int*)(0x42716320UL))
#define bFM4_MFS11_I2C_FBYTE_FD9               *((volatile unsigned int*)(0x42716324UL))
#define bFM4_MFS11_I2C_FBYTE_FD10              *((volatile unsigned int*)(0x42716328UL))
#define bFM4_MFS11_I2C_FBYTE_FD11              *((volatile unsigned int*)(0x4271632CUL))
#define bFM4_MFS11_I2C_FBYTE_FD12              *((volatile unsigned int*)(0x42716330UL))
#define bFM4_MFS11_I2C_FBYTE_FD13              *((volatile unsigned int*)(0x42716334UL))
#define bFM4_MFS11_I2C_FBYTE_FD14              *((volatile unsigned int*)(0x42716338UL))
#define bFM4_MFS11_I2C_FBYTE_FD15              *((volatile unsigned int*)(0x4271633CUL))
#define bFM4_MFS11_I2C_FBYTE1_FD0              *((volatile unsigned int*)(0x42716300UL))
#define bFM4_MFS11_I2C_FBYTE1_FD1              *((volatile unsigned int*)(0x42716304UL))
#define bFM4_MFS11_I2C_FBYTE1_FD2              *((volatile unsigned int*)(0x42716308UL))
#define bFM4_MFS11_I2C_FBYTE1_FD3              *((volatile unsigned int*)(0x4271630CUL))
#define bFM4_MFS11_I2C_FBYTE1_FD4              *((volatile unsigned int*)(0x42716310UL))
#define bFM4_MFS11_I2C_FBYTE1_FD5              *((volatile unsigned int*)(0x42716314UL))
#define bFM4_MFS11_I2C_FBYTE1_FD6              *((volatile unsigned int*)(0x42716318UL))
#define bFM4_MFS11_I2C_FBYTE1_FD7              *((volatile unsigned int*)(0x4271631CUL))
#define bFM4_MFS11_I2C_FBYTE2_FD8              *((volatile unsigned int*)(0x42716320UL))
#define bFM4_MFS11_I2C_FBYTE2_FD9              *((volatile unsigned int*)(0x42716324UL))
#define bFM4_MFS11_I2C_FBYTE2_FD10             *((volatile unsigned int*)(0x42716328UL))
#define bFM4_MFS11_I2C_FBYTE2_FD11             *((volatile unsigned int*)(0x4271632CUL))
#define bFM4_MFS11_I2C_FBYTE2_FD12             *((volatile unsigned int*)(0x42716330UL))
#define bFM4_MFS11_I2C_FBYTE2_FD13             *((volatile unsigned int*)(0x42716334UL))
#define bFM4_MFS11_I2C_FBYTE2_FD14             *((volatile unsigned int*)(0x42716338UL))
#define bFM4_MFS11_I2C_FBYTE2_FD15             *((volatile unsigned int*)(0x4271633CUL))

