RT-Thread/rt-thread/bsp/mb9bf568r/CMSIS/DeviceSupport/mb9b560r.h
/* MFS CSIO channel 14 registers */
#define bFM4_MFS14_CSIO_SMR_SOE                *((volatile unsigned int*)(0x4271C000UL))
#define bFM4_MFS14_CSIO_SMR_SCKE               *((volatile unsigned int*)(0x4271C004UL))
#define bFM4_MFS14_CSIO_SMR_BDS                *((volatile unsigned int*)(0x4271C008UL))
#define bFM4_MFS14_CSIO_SMR_SCINV              *((volatile unsigned int*)(0x4271C00CUL))
#define bFM4_MFS14_CSIO_SMR_MD0                *((volatile unsigned int*)(0x4271C014UL))
#define bFM4_MFS14_CSIO_SMR_MD1                *((volatile unsigned int*)(0x4271C018UL))
#define bFM4_MFS14_CSIO_SMR_MD2                *((volatile unsigned int*)(0x4271C01CUL))
#define bFM4_MFS14_CSIO_SCR_TXE                *((volatile unsigned int*)(0x4271C020UL))
#define bFM4_MFS14_CSIO_SCR_RXE                *((volatile unsigned int*)(0x4271C024UL))
#define bFM4_MFS14_CSIO_SCR_TBIE               *((volatile unsigned int*)(0x4271C028UL))
#define bFM4_MFS14_CSIO_SCR_TIE                *((volatile unsigned int*)(0x4271C02CUL))
#define bFM4_MFS14_CSIO_SCR_RIE                *((volatile unsigned int*)(0x4271C030UL))
#define bFM4_MFS14_CSIO_SCR_SPI                *((volatile unsigned int*)(0x4271C034UL))
#define bFM4_MFS14_CSIO_SCR_MS                 *((volatile unsigned int*)(0x4271C038UL))
#define bFM4_MFS14_CSIO_SCR_UPCL               *((volatile unsigned int*)(0x4271C03CUL))
#define bFM4_MFS14_CSIO_ESCR_L0                *((volatile unsigned int*)(0x4271C080UL))
#define bFM4_MFS14_CSIO_ESCR_L1                *((volatile unsigned int*)(0x4271C084UL))
#define bFM4_MFS14_CSIO_ESCR_L2                *((volatile unsigned int*)(0x4271C088UL))
#define bFM4_MFS14_CSIO_ESCR_WT0               *((volatile unsigned int*)(0x4271C08CUL))
#define bFM4_MFS14_CSIO_ESCR_WT1               *((volatile unsigned int*)(0x4271C090UL))
#define bFM4_MFS14_CSIO_ESCR_L3                *((volatile unsigned int*)(0x4271C098UL))
#define bFM4_MFS14_CSIO_ESCR_SOP               *((volatile unsigned int*)(0x4271C09CUL))
#define bFM4_MFS14_CSIO_SSR_TBI                *((volatile unsigned int*)(0x4271C0A0UL))
#define bFM4_MFS14_CSIO_SSR_TDRE               *((volatile unsigned int*)(0x4271C0A4UL))
#define bFM4_MFS14_CSIO_SSR_RDRF               *((volatile unsigned int*)(0x4271C0A8UL))
#define bFM4_MFS14_CSIO_SSR_ORE                *((volatile unsigned int*)(0x4271C0ACUL))
#define bFM4_MFS14_CSIO_SSR_AWC                *((volatile unsigned int*)(0x4271C0B0UL))
#define bFM4_MFS14_CSIO_SSR_REC                *((volatile unsigned int*)(0x4271C0BCUL))
#define bFM4_MFS14_CSIO_FCR_FE1                *((volatile unsigned int*)(0x4271C280UL))
#define bFM4_MFS14_CSIO_FCR_FE2                *((volatile unsigned int*)(0x4271C284UL))
#define bFM4_MFS14_CSIO_FCR_FCL1               *((volatile unsigned int*)(0x4271C288UL))
#define bFM4_MFS14_CSIO_FCR_FCL2               *((volatile unsigned int*)(0x4271C28CUL))
#define bFM4_MFS14_CSIO_FCR_FSET               *((volatile unsigned int*)(0x4271C290UL))
#define bFM4_MFS14_CSIO_FCR_FLD                *((volatile unsigned int*)(0x4271C294UL))
#define bFM4_MFS14_CSIO_FCR_FLST               *((volatile unsigned int*)(0x4271C298UL))
#define bFM4_MFS14_CSIO_FCR_FSEL               *((volatile unsigned int*)(0x4271C2A0UL))
#define bFM4_MFS14_CSIO_FCR_FTIE               *((volatile unsigned int*)(0x4271C2A4UL))
#define bFM4_MFS14_CSIO_FCR_FDRQ               *((volatile unsigned int*)(0x4271C2A8UL))
#define bFM4_MFS14_CSIO_FCR_FRIIE              *((volatile unsigned int*)(0x4271C2ACUL))
#define bFM4_MFS14_CSIO_FCR_FLSTE              *((volatile unsigned int*)(0x4271C2B0UL))
#define bFM4_MFS14_CSIO_FCR0_FE1               *((volatile unsigned int*)(0x4271C280UL))
#define bFM4_MFS14_CSIO_FCR0_FE2               *((volatile unsigned int*)(0x4271C284UL))
#define bFM4_MFS14_CSIO_FCR0_FCL1              *((volatile unsigned int*)(0x4271C288UL))
#define bFM4_MFS14_CSIO_FCR0_FCL2              *((volatile unsigned int*)(0x4271C28CUL))
#define bFM4_MFS14_CSIO_FCR0_FSET              *((volatile unsigned int*)(0x4271C290UL))
#define bFM4_MFS14_CSIO_FCR0_FLD               *((volatile unsigned int*)(0x4271C294UL))
#define bFM4_MFS14_CSIO_FCR0_FLST              *((volatile unsigned int*)(0x4271C298UL))
#define bFM4_MFS14_CSIO_FCR1_FSEL              *((volatile unsigned int*)(0x4271C2A0UL))
#define bFM4_MFS14_CSIO_FCR1_FTIE              *((volatile unsigned int*)(0x4271C2A4UL))
#define bFM4_MFS14_CSIO_FCR1_FDRQ              *((volatile unsigned int*)(0x4271C2A8UL))
#define bFM4_MFS14_CSIO_FCR1_FRIIE             *((volatile unsigned int*)(0x4271C2ACUL))
#define bFM4_MFS14_CSIO_FCR1_FLSTE             *((volatile unsigned int*)(0x4271C2B0UL))
#define bFM4_MFS14_CSIO_FBYTE_FD0              *((volatile unsigned int*)(0x4271C300UL))
#define bFM4_MFS14_CSIO_FBYTE_FD1              *((volatile unsigned int*)(0x4271C304UL))
#define bFM4_MFS14_CSIO_FBYTE_FD2              *((volatile unsigned int*)(0x4271C308UL))
#define bFM4_MFS14_CSIO_FBYTE_FD3              *((volatile unsigned int*)(0x4271C30CUL))
#define bFM4_MFS14_CSIO_FBYTE_FD4              *((volatile unsigned int*)(0x4271C310UL))
#define bFM4_MFS14_CSIO_FBYTE_FD5              *((volatile unsigned int*)(0x4271C314UL))
#define bFM4_MFS14_CSIO_FBYTE_FD6              *((volatile unsigned int*)(0x4271C318UL))
#define bFM4_MFS14_CSIO_FBYTE_FD7              *((volatile unsigned int*)(0x4271C31CUL))
#define bFM4_MFS14_CSIO_FBYTE_FD8              *((volatile unsigned int*)(0x4271C320UL))
#define bFM4_MFS14_CSIO_FBYTE_FD9              *((volatile unsigned int*)(0x4271C324UL))
#define bFM4_MFS14_CSIO_FBYTE_FD10             *((volatile unsigned int*)(0x4271C328UL))
#define bFM4_MFS14_CSIO_FBYTE_FD11             *((volatile unsigned int*)(0x4271C32CUL))
#define bFM4_MFS14_CSIO_FBYTE_FD12             *((volatile unsigned int*)(0x4271C330UL))
#define bFM4_MFS14_CSIO_FBYTE_FD13             *((volatile unsigned int*)(0x4271C334UL))
#define bFM4_MFS14_CSIO_FBYTE_FD14             *((volatile unsigned int*)(0x4271C338UL))
#define bFM4_MFS14_CSIO_FBYTE_FD15             *((volatile unsigned int*)(0x4271C33CUL))
#define bFM4_MFS14_CSIO_FBYTE1_FD0             *((volatile unsigned int*)(0x4271C300UL))
#define bFM4_MFS14_CSIO_FBYTE1_FD1             *((volatile unsigned int*)(0x4271C304UL))
#define bFM4_MFS14_CSIO_FBYTE1_FD2             *((volatile unsigned int*)(0x4271C308UL))
#define bFM4_MFS14_CSIO_FBYTE1_FD3             *((volatile unsigned int*)(0x4271C30CUL))
#define bFM4_MFS14_CSIO_FBYTE1_FD4             *((volatile unsigned int*)(0x4271C310UL))
#define bFM4_MFS14_CSIO_FBYTE1_FD5             *((volatile unsigned int*)(0x4271C314UL))
#define bFM4_MFS14_CSIO_FBYTE1_FD6             *((volatile unsigned int*)(0x4271C318UL))
#define bFM4_MFS14_CSIO_FBYTE1_FD7             *((volatile unsigned int*)(0x4271C31CUL))
#define bFM4_MFS14_CSIO_FBYTE2_FD8             *((volatile unsigned int*)(0x4271C320UL))
#define bFM4_MFS14_CSIO_FBYTE2_FD9             *((volatile unsigned int*)(0x4271C324UL))
#define bFM4_MFS14_CSIO_FBYTE2_FD10            *((volatile unsigned int*)(0x4271C328UL))
#define bFM4_MFS14_CSIO_FBYTE2_FD11            *((volatile unsigned int*)(0x4271C32CUL))
#define bFM4_MFS14_CSIO_FBYTE2_FD12            *((volatile unsigned int*)(0x4271C330UL))
#define bFM4_MFS14_CSIO_FBYTE2_FD13            *((volatile unsigned int*)(0x4271C334UL))
#define bFM4_MFS14_CSIO_FBYTE2_FD14            *((volatile unsigned int*)(0x4271C338UL))
#define bFM4_MFS14_CSIO_FBYTE2_FD15            *((volatile unsigned int*)(0x4271C33CUL))
#define bFM4_MFS14_CSIO_SCSTR10_CSHD0          *((volatile unsigned int*)(0x4271C380UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSHD1          *((volatile unsigned int*)(0x4271C384UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSHD2          *((volatile unsigned int*)(0x4271C388UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSHD3          *((volatile unsigned int*)(0x4271C38CUL))
#define bFM4_MFS14_CSIO_SCSTR10_CSHD4          *((volatile unsigned int*)(0x4271C390UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSHD5          *((volatile unsigned int*)(0x4271C394UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSHD6          *((volatile unsigned int*)(0x4271C398UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSHD7          *((volatile unsigned int*)(0x4271C39CUL))
#define bFM4_MFS14_CSIO_SCSTR10_CSSU0          *((volatile unsigned int*)(0x4271C3A0UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSSU1          *((volatile unsigned int*)(0x4271C3A4UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSSU2          *((volatile unsigned int*)(0x4271C3A8UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSSU3          *((volatile unsigned int*)(0x4271C3ACUL))
#define bFM4_MFS14_CSIO_SCSTR10_CSSU4          *((volatile unsigned int*)(0x4271C3B0UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSSU5          *((volatile unsigned int*)(0x4271C3B4UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSSU6          *((volatile unsigned int*)(0x4271C3B8UL))
#define bFM4_MFS14_CSIO_SCSTR10_CSSU7          *((volatile unsigned int*)(0x4271C3BCUL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS0          *((volatile unsigned int*)(0x4271C400UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS1          *((volatile unsigned int*)(0x4271C404UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS2          *((volatile unsigned int*)(0x4271C408UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS3          *((volatile unsigned int*)(0x4271C40CUL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS4          *((volatile unsigned int*)(0x4271C410UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS5          *((volatile unsigned int*)(0x4271C414UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS6          *((volatile unsigned int*)(0x4271C418UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS7          *((volatile unsigned int*)(0x4271C41CUL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS8          *((volatile unsigned int*)(0x4271C420UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS9          *((volatile unsigned int*)(0x4271C424UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS10         *((volatile unsigned int*)(0x4271C428UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS11         *((volatile unsigned int*)(0x4271C42CUL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS12         *((volatile unsigned int*)(0x4271C430UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS13         *((volatile unsigned int*)(0x4271C434UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS14         *((volatile unsigned int*)(0x4271C438UL))
#define bFM4_MFS14_CSIO_SCSTR32_CSDS15         *((volatile unsigned int*)(0x4271C43CUL))
#define bFM4_MFS14_CSIO_SACSR_TMRE             *((volatile unsigned int*)(0x4271C480UL))
#define bFM4_MFS14_CSIO_SACSR_TDIV0            *((volatile unsigned int*)(0x4271C484UL))
#define bFM4_MFS14_CSIO_SACSR_TDIV1            *((volatile unsigned int*)(0x4271C488UL))
#define bFM4_MFS14_CSIO_SACSR_TDIV2            *((volatile unsigned int*)(0x4271C48CUL))
#define bFM4_MFS14_CSIO_SACSR_TDIV3            *((volatile unsigned int*)(0x4271C490UL))
#define bFM4_MFS14_CSIO_SACSR_TSYNE            *((volatile unsigned int*)(0x4271C498UL))
#define bFM4_MFS14_CSIO_SACSR_TINTE            *((volatile unsigned int*)(0x4271C49CUL))
#define bFM4_MFS14_CSIO_SACSR_TINT             *((volatile unsigned int*)(0x4271C4A0UL))
#define bFM4_MFS14_CSIO_SACSR_CSE              *((volatile unsigned int*)(0x4271C4ACUL))
#define bFM4_MFS14_CSIO_SACSR_CSEIE            *((volatile unsigned int*)(0x4271C4B0UL))
#define bFM4_MFS14_CSIO_SACSR_TBEEN            *((volatile unsigned int*)(0x4271C4B4UL))
#define bFM4_MFS14_CSIO_STMR_TM0               *((volatile unsigned int*)(0x4271C500UL))
#define bFM4_MFS14_CSIO_STMR_TM1               *((volatile unsigned int*)(0x4271C504UL))
#define bFM4_MFS14_CSIO_STMR_TM2               *((volatile unsigned int*)(0x4271C508UL))
#define bFM4_MFS14_CSIO_STMR_TM3               *((volatile unsigned int*)(0x4271C50CUL))
#define bFM4_MFS14_CSIO_STMR_TM4               *((volatile unsigned int*)(0x4271C510UL))
#define bFM4_MFS14_CSIO_STMR_TM5               *((volatile unsigned int*)(0x4271C514UL))
#define bFM4_MFS14_CSIO_STMR_TM6               *((volatile unsigned int*)(0x4271C518UL))
#define bFM4_MFS14_CSIO_STMR_TM7               *((volatile unsigned int*)(0x4271C51CUL))
#define bFM4_MFS14_CSIO_STMR_TM8               *((volatile unsigned int*)(0x4271C520UL))
#define bFM4_MFS14_CSIO_STMR_TM9               *((volatile unsigned int*)(0x4271C524UL))
#define bFM4_MFS14_CSIO_STMR_TM10              *((volatile unsigned int*)(0x4271C528UL))
#define bFM4_MFS14_CSIO_STMR_TM11              *((volatile unsigned int*)(0x4271C52CUL))
#define bFM4_MFS14_CSIO_STMR_TM12              *((volatile unsigned int*)(0x4271C530UL))
#define bFM4_MFS14_CSIO_STMR_TM13              *((volatile unsigned int*)(0x4271C534UL))
#define bFM4_MFS14_CSIO_STMR_TM14              *((volatile unsigned int*)(0x4271C538UL))
#define bFM4_MFS14_CSIO_STMR_TM15              *((volatile unsigned int*)(0x4271C53CUL))
#define bFM4_MFS14_CSIO_STMCR_TC0              *((volatile unsigned int*)(0x4271C580UL))
#define bFM4_MFS14_CSIO_STMCR_TC1              *((volatile unsigned int*)(0x4271C584UL))
#define bFM4_MFS14_CSIO_STMCR_TC2              *((volatile unsigned int*)(0x4271C588UL))
#define bFM4_MFS14_CSIO_STMCR_TC3              *((volatile unsigned int*)(0x4271C58CUL))
#define bFM4_MFS14_CSIO_STMCR_TC4              *((volatile unsigned int*)(0x4271C590UL))
#define bFM4_MFS14_CSIO_STMCR_TC5              *((volatile unsigned int*)(0x4271C594UL))
#define bFM4_MFS14_CSIO_STMCR_TC6              *((volatile unsigned int*)(0x4271C598UL))
#define bFM4_MFS14_CSIO_STMCR_TC7              *((volatile unsigned int*)(0x4271C59CUL))
#define bFM4_MFS14_CSIO_STMCR_TC8              *((volatile unsigned int*)(0x4271C5A0UL))
#define bFM4_MFS14_CSIO_STMCR_TC9              *((volatile unsigned int*)(0x4271C5A4UL))
#define bFM4_MFS14_CSIO_STMCR_TC10             *((volatile unsigned int*)(0x4271C5A8UL))
#define bFM4_MFS14_CSIO_STMCR_TC11             *((volatile unsigned int*)(0x4271C5ACUL))
#define bFM4_MFS14_CSIO_STMCR_TC12             *((volatile unsigned int*)(0x4271C5B0UL))
#define bFM4_MFS14_CSIO_STMCR_TC13             *((volatile unsigned int*)(0x4271C5B4UL))
#define bFM4_MFS14_CSIO_STMCR_TC14             *((volatile unsigned int*)(0x4271C5B8UL))
#define bFM4_MFS14_CSIO_STMCR_TC15             *((volatile unsigned int*)(0x4271C5BCUL))
#define bFM4_MFS14_CSIO_SCSCR_CSOE             *((volatile unsigned int*)(0x4271C600UL))
#define bFM4_MFS14_CSIO_SCSCR_CSEN0            *((volatile unsigned int*)(0x4271C604UL))
#define bFM4_MFS14_CSIO_SCSCR_CSLVL            *((volatile unsigned int*)(0x4271C614UL))
#define bFM4_MFS14_CSIO_SCSCR_CDIV0            *((volatile unsigned int*)(0x4271C618UL))
#define bFM4_MFS14_CSIO_SCSCR_CDIV1            *((volatile unsigned int*)(0x4271C61CUL))
#define bFM4_MFS14_CSIO_SCSCR_CDIV2            *((volatile unsigned int*)(0x4271C620UL))
#define bFM4_MFS14_CSIO_SCSCR_SCAM             *((volatile unsigned int*)(0x4271C624UL))

/* MFS LIN channel 14 registers */
#define bFM4_MFS14_LIN_SMR_SOE                 *((volatile unsigned int*)(0x4271C000UL))
#define bFM4_MFS14_LIN_SMR_SBL                 *((volatile unsigned int*)(0x4271C00CUL))
#define bFM4_MFS14_LIN_SMR_WUCR                *((volatile unsigned int*)(0x4271C010UL))
#define bFM4_MFS14_LIN_SMR_MD0                 *((volatile unsigned int*)(0x4271C014UL))
#define bFM4_MFS14_LIN_SMR_MD1                 *((volatile unsigned int*)(0x4271C018UL))
#define bFM4_MFS14_LIN_SMR_MD2                 *((volatile unsigned int*)(0x4271C01CUL))
#define bFM4_MFS14_LIN_SCR_TXE                 *((volatile unsigned int*)(0x4271C020UL))
#define bFM4_MFS14_LIN_SCR_RXE                 *((volatile unsigned int*)(0x4271C024UL))
#define bFM4_MFS14_LIN_SCR_TBIE                *((volatile unsigned int*)(0x4271C028UL))
#define bFM4_MFS14_LIN_SCR_TIE                 *((volatile unsigned int*)(0x4271C02CUL))
#define bFM4_MFS14_LIN_SCR_RIE                 *((volatile unsigned int*)(0x4271C030UL))
#define bFM4_MFS14_LIN_SCR_LBR                 *((volatile unsigned int*)(0x4271C034UL))
#define bFM4_MFS14_LIN_SCR_MS                  *((volatile unsigned int*)(0x4271C038UL))
#define bFM4_MFS14_LIN_SCR_UPCL                *((volatile unsigned int*)(0x4271C03CUL))
#define bFM4_MFS14_LIN_ESCR_DEL0               *((volatile unsigned int*)(0x4271C080UL))
#define bFM4_MFS14_LIN_ESCR_DEL1               *((volatile unsigned int*)(0x4271C084UL))
#define bFM4_MFS14_LIN_ESCR_LBL0               *((volatile unsigned int*)(0x4271C088UL))
#define bFM4_MFS14_LIN_ESCR_LBL1               *((volatile unsigned int*)(0x4271C08CUL))
#define bFM4_MFS14_LIN_ESCR_LBIE               *((volatile unsigned int*)(0x4271C090UL))
#define bFM4_MFS14_LIN_ESCR_ESBL               *((volatile unsigned int*)(0x4271C098UL))
#define bFM4_MFS14_LIN_SSR_TBI                 *((volatile unsigned int*)(0x4271C0A0UL))
#define bFM4_MFS14_LIN_SSR_TDRE                *((volatile unsigned int*)(0x4271C0A4UL))
#define bFM4_MFS14_LIN_SSR_RDRF                *((volatile unsigned int*)(0x4271C0A8UL))
#define bFM4_MFS14_LIN_SSR_ORE                 *((volatile unsigned int*)(0x4271C0ACUL))
#define bFM4_MFS14_LIN_SSR_FRE                 *((volatile unsigned int*)(0x4271C0B0UL))
#define bFM4_MFS14_LIN_SSR_LBD                 *((volatile unsigned int*)(0x4271C0B4UL))
#define bFM4_MFS14_LIN_SSR_REC                 *((volatile unsigned int*)(0x4271C0BCUL))
#define bFM4_MFS14_LIN_BGR_EXT                 *((volatile unsigned int*)(0x4271C1BCUL))
#define bFM4_MFS14_LIN_BGR1_EXT                *((volatile unsigned int*)(0x4271C1BCUL))
#define bFM4_MFS14_LIN_FCR_FE1                 *((volatile unsigned int*)(0x4271C280UL))
#define bFM4_MFS14_LIN_FCR_FE2                 *((volatile unsigned int*)(0x4271C284UL))
#define bFM4_MFS14_LIN_FCR_FCL1                *((volatile unsigned int*)(0x4271C288UL))
#define bFM4_MFS14_LIN_FCR_FCL2                *((volatile unsigned int*)(0x4271C28CUL))
#define bFM4_MFS14_LIN_FCR_FSET                *((volatile unsigned int*)(0x4271C290UL))
#define bFM4_MFS14_LIN_FCR_FLD                 *((volatile unsigned int*)(0x4271C294UL))
#define bFM4_MFS14_LIN_FCR_FLST                *((volatile unsigned int*)(0x4271C298UL))
#define bFM4_MFS14_LIN_FCR_FSEL                *((volatile unsigned int*)(0x4271C2A0UL))
#define bFM4_MFS14_LIN_FCR_FTIE                *((volatile unsigned int*)(0x4271C2A4UL))
#define bFM4_MFS14_LIN_FCR_FDRQ                *((volatile unsigned int*)(0x4271C2A8UL))
#define bFM4_MFS14_LIN_FCR_FRIIE               *((volatile unsigned int*)(0x4271C2ACUL))
#define bFM4_MFS14_LIN_FCR_FLSTE               *((volatile unsigned int*)(0x4271C2B0UL))
#define bFM4_MFS14_LIN_FCR0_FE1                *((volatile unsigned int*)(0x4271C280UL))
#define bFM4_MFS14_LIN_FCR0_FE2                *((volatile unsigned int*)(0x4271C284UL))
#define bFM4_MFS14_LIN_FCR0_FCL1               *((volatile unsigned int*)(0x4271C288UL))
#define bFM4_MFS14_LIN_FCR0_FCL2               *((volatile unsigned int*)(0x4271C28CUL))
#define bFM4_MFS14_LIN_FCR0_FSET               *((volatile unsigned int*)(0x4271C290UL))
#define bFM4_MFS14_LIN_FCR0_FLD                *((volatile unsigned int*)(0x4271C294UL))
#define bFM4_MFS14_LIN_FCR0_FLST               *((volatile unsigned int*)(0x4271C298UL))
#define bFM4_MFS14_LIN_FCR1_FSEL               *((volatile unsigned int*)(0x4271C2A0UL))
#define bFM4_MFS14_LIN_FCR1_FTIE               *((volatile unsigned int*)(0x4271C2A4UL))
#define bFM4_MFS14_LIN_FCR1_FDRQ               *((volatile unsigned int*)(0x4271C2A8UL))
#define bFM4_MFS14_LIN_FCR1_FRIIE              *((volatile unsigned int*)(0x4271C2ACUL))
#define bFM4_MFS14_LIN_FCR1_FLSTE              *((volatile unsigned int*)(0x4271C2B0UL))
#define bFM4_MFS14_LIN_FBYTE_FD0               *((volatile unsigned int*)(0x4271C300UL))
#define bFM4_MFS14_LIN_FBYTE_FD1               *((volatile unsigned int*)(0x4271C304UL))
#define bFM4_MFS14_LIN_FBYTE_FD2               *((volatile unsigned int*)(0x4271C308UL))
#define bFM4_MFS14_LIN_FBYTE_FD3               *((volatile unsigned int*)(0x4271C30CUL))
#define bFM4_MFS14_LIN_FBYTE_FD4               *((volatile unsigned int*)(0x4271C310UL))
#define bFM4_MFS14_LIN_FBYTE_FD5               *((volatile unsigned int*)(0x4271C314UL))
#define bFM4_MFS14_LIN_FBYTE_FD6               *((volatile unsigned int*)(0x4271C318UL))
#define bFM4_MFS14_LIN_FBYTE_FD7               *((volatile unsigned int*)(0x4271C31CUL))
#define bFM4_MFS14_LIN_FBYTE_FD8               *((volatile unsigned int*)(0x4271C320UL))
#define bFM4_MFS14_LIN_FBYTE_FD9               *((volatile unsigned int*)(0x4271C324UL))
#define bFM4_MFS14_LIN_FBYTE_FD10              *((volatile unsigned int*)(0x4271C328UL))
#define bFM4_MFS14_LIN_FBYTE_FD11              *((volatile unsigned int*)(0x4271C32CUL))
#define bFM4_MFS14_LIN_FBYTE_FD12              *((volatile unsigned int*)(0x4271C330UL))
#define bFM4_MFS14_LIN_FBYTE_FD13              *((volatile unsigned int*)(0x4271C334UL))
#define bFM4_MFS14_LIN_FBYTE_FD14              *((volatile unsigned int*)(0x4271C338UL))
#define bFM4_MFS14_LIN_FBYTE_FD15              *((volatile unsigned int*)(0x4271C33CUL))
#define bFM4_MFS14_LIN_FBYTE1_FD0              *((volatile unsigned int*)(0x4271C300UL))
#define bFM4_MFS14_LIN_FBYTE1_FD1              *((volatile unsigned int*)(0x4271C304UL))
#define bFM4_MFS14_LIN_FBYTE1_FD2              *((volatile unsigned int*)(0x4271C308UL))
#define bFM4_MFS14_LIN_FBYTE1_FD3              *((volatile unsigned int*)(0x4271C30CUL))
#define bFM4_MFS14_LIN_FBYTE1_FD4              *((volatile unsigned int*)(0x4271C310UL))
#define bFM4_MFS14_LIN_FBYTE1_FD5              *((volatile unsigned int*)(0x4271C314UL))
#define bFM4_MFS14_LIN_FBYTE1_FD6              *((volatile unsigned int*)(0x4271C318UL))
#define bFM4_MFS14_LIN_FBYTE1_FD7              *((volatile unsigned int*)(0x4271C31CUL))
#define bFM4_MFS14_LIN_FBYTE2_FD8              *((volatile unsigned int*)(0x4271C320UL))
#define bFM4_MFS14_LIN_FBYTE2_FD9              *((volatile unsigned int*)(0x4271C324UL))
#define bFM4_MFS14_LIN_FBYTE2_FD10             *((volatile unsigned int*)(0x4271C328UL))
#define bFM4_MFS14_LIN_FBYTE2_FD11             *((volatile unsigned int*)(0x4271C32CUL))
#define bFM4_MFS14_LIN_FBYTE2_FD12             *((volatile unsigned int*)(0x4271C330UL))
#define bFM4_MFS14_LIN_FBYTE2_FD13             *((volatile unsigned int*)(0x4271C334UL))
#define bFM4_MFS14_LIN_FBYTE2_FD14             *((volatile unsigned int*)(0x4271C338UL))
#define bFM4_MFS14_LIN_FBYTE2_FD15             *((volatile unsigned int*)(0x4271C33CUL))

